[{"name": "jQuery", "category": "Application and Data", "subcategory": "Libraries", "title": "The Write Less, Do More, JavaScript Library.", "description": "jQuery is a cross-platform JavaScript library designed to simplify the client-side scripting of HTML.", "tool_function": "Javascript UI Libraries"}, {"name": "Bootstrap", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Simple and flexible HTML, CSS, and JS for popular UI components and interactions", "description": "Bootstrap is the most popular HTML, CSS, and JS framework for developing responsive, mobile first projects on the web.", "tool_function": "Front-End Frameworks"}, {"name": "NGINX", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A high performance free open source web server powering busiest sites on the Internet.", "description": "nginx [engine x] is an HTTP and reverse proxy server, as well as a mail proxy server, written by Igor Sysoev. According to Netcraft nginx served or proxied 30.46% of the top million busiest sites in Jan 2018.", "tool_function": "Web Servers"}, {"name": "PHP", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A popular general-purpose scripting language that is especially suited to web development", "description": "Fast, flexible and pragmatic, PHP powers everything from your blog to the most popular websites in the world.", "tool_function": "Languages"}, {"name": "Apache HTTP Server", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Open-source HTTP server for modern operating systems including UNIX and Windows", "description": "The Apache HTTP Server is a powerful and flexible HTTP/1.1 compliant web server.  Originally designed as a replacement for the NCSA HTTP Server, it has grown to be the most popular web server on the Internet.", "tool_function": "Web Servers"}, {"name": "Java", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A concurrent, class-based, object-oriented, language specifically designed to have as few implementation dependencies as possible", "description": "Java is a programming language and computing platform first released by Sun Microsystems in 1995. There are lots of applications and websites that will not work unless you have Java installed, and more are created every day. Java is fast, secure, and reliable. From laptops to datacenters, game consoles to scientific supercomputers, cell phones to the Internet, Java is everywhere!", "tool_function": "Languages"}, {"name": "jQuery UI", "category": "Application and Data", "subcategory": "Libraries", "title": "Curated set of user interface interactions, effects, widgets, and themes built on top of the jQuery JavaScript Library", "description": "Whether you're building highly interactive web applications or you just need to add a date picker to a form control, jQuery UI is the perfect choice.", "tool_function": "Javascript UI Libraries"}, {"name": "Modernizr", "category": "Application and Data", "subcategory": "Libraries", "title": "Respond to your user’s browser features", "description": "It’s a collection of superfast tests or detects as we like to call them which run as your web page loads, then you can use the results to tailor the experience to the user. It tells you what HTML, CSS and JavaScript features the user’s browser has to offer.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "CloudFlare", "category": "Application and Data", "subcategory": "Assets and Media", "title": "The Web Performance & Security Company.", "description": "Cloudflare speeds up and protects millions of websites, APIs, SaaS services, and other properties connected to the Internet.", "tool_function": "Content Delivery Network"}, {"name": "JavaScript", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Lightweight, interpreted, object-oriented language with first-class functions", "description": "JavaScript is most known as the scripting language for Web pages, but used in many non-browser environments as well such as node.js or Apache CouchDB. It is a prototype-based, multi-paradigm scripting language that is dynamic,and supports object-oriented, imperative, and functional programming styles. ", "tool_function": "Languages"}, {"name": "Microsoft IIS", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A web server for Microsoft Windows", "description": "Internet Information Services (IIS) for Windows Server is a flexible, secure and manageable Web server for hosting anything on the Web. From media streaming to web applications, IIS's scalable and open architecture is ready to handle the most demanding tasks.", "tool_function": "Web Servers"}, {"name": "AngularJS", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Superheroic JavaScript MVW Framework", "description": "AngularJS lets you write client-side web applications as if you had a smarter browser. It lets you use good old HTML (or HAML, Jade and friends!) as your template language and lets you extend HTML’s syntax to express your application’s components clearly and succinctly. It automatically synchronizes data from your UI (view) with your JavaScript objects (model) through 2-way data binding.", "tool_function": "Javascript MVC Frameworks"}, {"name": "React", "category": "Application and Data", "subcategory": "Libraries", "title": "A JavaScript library for building user interfaces", "description": "Lots of people use React as the V in MVC. Since React makes no assumptions about the rest of your technology stack, it's easy to try it out on a small feature in an existing project.", "tool_function": "Javascript UI Libraries"}, {"name": "Python", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A clear and powerful object-oriented programming language, comparable to Perl, Ruby, Scheme, or Java.", "description": "Python is a general purpose programming language created by Guido Van Rossum. Python is most praised for its elegant syntax and readable code, if you are just beginning your programming career python suits you best.", "tool_function": "Languages"}, {"name": "ASP.NET", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "An open source web framework for building modern web apps and services with .NET", "description": ".NET is a developer platform made up of tools, programming languages, and libraries for building many different types of applications.", "tool_function": "Languages"}, {"name": "Moment.js", "category": "Application and Data", "subcategory": "Libraries", "title": "A JavaScript date library for parsing, validating, manipulating, and formatting dates", "description": "A javascript date library for parsing, validating, manipulating, and formatting dates.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Amazon CloudFront", "category": "Application and Data", "subcategory": "Assets and Media", "title": "Content delivery with low latency and high data transfer speeds", "description": "Amazon CloudFront can be used to deliver your entire website, including dynamic, static, streaming, and interactive content using a global network of edge locations. Requests for your content are automatically routed to the nearest edge location, so content is delivered with the best possible performance.", "tool_function": "Content Delivery Network"}, {"name": "Slick", "category": "Application and Data", "subcategory": "Data Stores", "title": "Database query and access library for Scala", "description": "It is a modern database query and access library for Scala. It allows you to work with stored data almost as if you were using Scala collections while at the same time giving you full control over when a database access happens and which data is transferred. ", "tool_function": "Database Tools"}, {"name": "Backbone.js", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Give your JS App some Backbone with Models, Views, Collections, and Events", "description": "Backbone supplies structure to JavaScript-heavy applications by providing models key-value binding and custom events, collections with a rich API of enumerable functions, views with declarative event handling, and connects it all to your existing application over a RESTful JSON interface.", "tool_function": "Javascript MVC Frameworks"}, {"name": "Google Cloud Platform", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A suite of cloud computing services", "description": "It helps you build what's next with secure infrastructure, developer tools, APIs, data analytics and machine learning. It is a suite of cloud computing services that runs on the same infrastructure that Google uses internally for its end-user products, such as Google Search and YouTube.", "tool_function": "Cloud Hosting"}, {"name": "Apache Tomcat", "category": "Application and Data", "subcategory": "Application Hosting", "title": "An open source software implementation of the Java Servlet and JavaServer Pages technologies", "description": "Apache Tomcat powers numerous large-scale, mission-critical web applications across a diverse range of industries and organizations.", "tool_function": "Web Servers"}, {"name": "fancybox", "category": "Application and Data", "subcategory": "Libraries", "title": "JavaScript lightbox library for presenting various types of media", "description": "It is a tool that offers a nice and elegant way to add zooming functionality for images, html content and multi-media on your webpages. It is built on the top of the popular JavaScript framework jQuery and is both easy to implement and a snap to customize.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Ubuntu", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The leading OS for PC, tablet, phone and cloud", "description": "Ubuntu is an ancient African word meaning ‘humanity to others’. It also means ‘I am what I am because of who we all are’. The Ubuntu operating system brings the spirit of Ubuntu to the world of computers.", "tool_function": "Operating Systems"}, {"name": "Ruby", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A dynamic, interpreted, open source programming language with a focus on simplicity and productivity", "description": "Ruby is a language of careful balance. Its creator, Yukihiro “Matz” Matsumoto, blended parts of his favorite languages (Perl, Smalltalk, Eiffel, Ada, and Lisp) to form a new language that balanced functional programming with imperative programming.", "tool_function": "Languages"}, {"name": "C#", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Simple, general-purpose, object-oriented programming language for the .NET platform", "description": "C# (pronounced \"See Sharp\") is a simple, modern, object-oriented, and type-safe programming language. C# has its roots in the C family of languages and will be immediately familiar to C, C++, Java, and JavaScript programmers.", "tool_function": "Languages"}, {"name": "CSS 3", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The latest evolution of the Cascading Style Sheets language", "description": "CSS3 is the latest evolution of the Cascading Style Sheets language and aims at extending CSS2.1. It brings a lot of long-awaited novelties, like rounded corners, shadows, gradients, transitions or animations, as well as new layouts like multi-columns, flexible box or grid layouts. Experimental parts are vendor-prefixed and should either be avoided in production environments, or used with extreme caution as both their syntax and semantics can change in the future.", "tool_function": "Languages"}, {"name": "Amazon S3", "category": "Application and Data", "subcategory": "Data Stores", "title": "Store and retrieve any amount of data, at any time, from anywhere on the web", "description": "Amazon Simple Storage Service provides a fully redundant data storage infrastructure for storing and retrieving any amount of data, at any time, from anywhere on the web", "tool_function": "Cloud Storage"}, {"name": "TypeScript", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A superset of JavaScript that compiles to clean JavaScript output", "description": "TypeScript is a language for application-scale JavaScript development. It's a typed superset of JavaScript that compiles to plain JavaScript.", "tool_function": "Templating Languages & Extensions"}, {"name": ".NET", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A free, cross-platform, open source developer platform for building many different types of applications", "description": ".NET is a general purpose development platform. With .NET, you can use multiple languages, editors, and libraries to build native applications for web, mobile, desktop, gaming, and IoT for Windows, macOS, Linux, Android, and more.", "tool_function": "Frameworks (Full Stack)"}, {"name": "Microsoft Azure", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Integrated cloud services and infrastructure to support computing, database, analytics, mobile, and web scenarios.", "description": "Azure is an open and flexible cloud platform that enables you to quickly build, deploy and manage applications across a global network of Microsoft-managed datacenters. You can build applications using any language, tool or framework. And you can integrate your public cloud applications with your existing IT environment.", "tool_function": "Cloud Hosting"}, {"name": "Handlebars.js", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Minimal Templating on Steroids", "description": "Handlebars.js is an extension to the Mustache templating language created by Chris Wanstrath. Handlebars.js and Mustache are both logicless templating languages that keep the view and the code separated like we all know they should be.", "tool_function": "Templating Languages & Extensions"}, {"name": "Highcharts", "category": "Application and Data", "subcategory": "Libraries", "title": "A charting library written in pure JavaScript, offering an easy way of adding interactive charts to your web site or web application", "description": "Highcharts currently supports line, spline, area, areaspline, column, bar, pie, scatter, angular gauges, arearange, areasplinerange, columnrange, bubble, box plot, error bars, funnel, waterfall and polar chart types.", "tool_function": "Charting Libraries"}, {"name": "Amazon EC2", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Scalable, pay-as-you-go compute capacity in the cloud", "description": "It is a web service that provides resizable compute capacity in the cloud. It is designed to make web-scale computing easier for developers.", "tool_function": "Cloud Hosting"}, {"name": "Golang", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "An open source programming language that makes it easy to build simple, reliable, and efficient software", "description": "Go is expressive, concise, clean, and efficient. Its concurrency mechanisms make it easy to write programs that get the most out of multicore and networked machines, while its novel type system enables flexible and modular program construction. Go compiles quickly to machine code yet has the convenience of garbage collection and the power of run-time reflection. It's a fast, statically typed, compiled language that feels like a dynamically typed, interpreted language.", "tool_function": "Languages"}, {"name": "Akamai", "category": "Application and Data", "subcategory": "Assets and Media", "title": "The leading platform for cloud, mobile, media and security across any device, anywhere.", "description": "If you've ever shopped online, downloaded music, watched a web video or connected to work remotely, you've probably used Akamai's cloud platform. Akamai helps businesses connect the hyperconnected, empowering them to transform and reinvent their business online. We remove the complexities of technology, so you can focus on driving your business faster forward.", "tool_function": "Content Delivery Network"}, {"name": "Vue.js", "category": "Application and Data", "subcategory": "Libraries", "title": "A progressive framework for building user interfaces", "description": "It is a library for building interactive web interfaces. It provides data-reactive components with a simple and flexible API. ", "tool_function": "Javascript UI Libraries"}, {"name": "PostgreSQL", "category": "Application and Data", "subcategory": "Data Stores", "title": "A powerful, open source object-relational database system", "description": "PostgreSQL is an advanced object-relational database management system\r\nthat supports an extended subset of the SQL standard, including\r\ntransactions, foreign keys, subqueries, triggers, user-defined types\r\nand functions.", "tool_function": "Databases"}, {"name": "Node.js", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications", "description": "Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices.", "tool_function": "Frameworks (Full Stack)"}, {"name": "YUI Library", "category": "Application and Data", "subcategory": "Libraries", "title": "Open Source JavaScript library for building richly interactive web applications ", "description": "It is a free, open source JavaScript and CSS library for building richly interactive web applications. Its lightweight core and modular architecture make it scalable, fast, and robust. ", "tool_function": "Javascript UI Libraries"}, {"name": "Rails", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Web development that doesn't hurt", "description": "Rails is a web-application framework that includes everything needed to create database-backed web applications according to the Model-View-Controller (MVC) pattern.", "tool_function": "Frameworks (Full Stack)"}, {"name": "CentOS", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The Community ENTerprise Operating System", "description": "The CentOS Project is a community-driven free software effort focused on delivering a robust open source ecosystem. For users, we offer a consistent manageable platform that suits a wide variety of deployments. For open source communities, we offer a solid, predictable base to build upon, along with extensive resources to build, test, release, and maintain their code.", "tool_function": "Operating Systems"}, {"name": "Underscore", "category": "Application and Data", "subcategory": "Libraries", "title": "JavaScript's utility _ belt", "description": "A JavaScript library that provides a whole mess of useful functional programming helpers without extending any built-in objects. ", "tool_function": "Javascript Utilities & Libraries"}, {"name": "OpenResty", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Turning Nginx into a Full-fledged Web App Server", "description": "OpenResty (aka. ngx_openresty) is a full-fledged web application server by bundling the standard Nginx core, lots of 3rd-party Nginx modules, as well as most of their external dependencies.", "tool_function": "Web Servers"}, {"name": "MySQL", "category": "Application and Data", "subcategory": "Data Stores", "title": "The world's most popular open source database", "description": "The MySQL software delivers a very fast, multi-threaded, multi-user, and robust SQL (Structured Query Language) database server. MySQL Server is intended for mission-critical, heavy-load production systems as well as for embedding into mass-deployed software.", "tool_function": "Databases"}, {"name": "Animate.css", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A library of CSS animations", "description": "It is a bunch of cool, fun, and cross-browser animations for you to use in your projects. Great for emphasis, home pages, sliders, and general just-add-water-awesomeness.", "tool_function": "Front-End Frameworks"}, {"name": "Shell", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A shell is a text-based terminal, used for manipulating programs and files. Shell scripts typically manage program execution.", "description": "A shell is a text-based terminal, used for manipulating programs and files. Shell scripts typically manage program execution.", "tool_function": "Shells"}, {"name": "Incapsula", "category": "Application and Data", "subcategory": "Assets and Media", "title": "Cloud-based service that makes websites safer, faster and more reliable. ", "description": "Through an application-aware, global content delivery network (CDN), Incapsula provides any website and web application with best-of-breed security, DDoS protection, load balancing and failover solutions.", "tool_function": "Content Delivery Network"}, {"name": "Mustache", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Logic-less templates", "description": "Mustache is a logic-less template syntax. It can be used for HTML, config files, source code - anything. It works by expanding tags in a template using values provided in a hash or object. We call it \"logic-less\" because there are no if statements, else clauses, or for loops. Instead there are only tags. Some tags are replaced with a value, some nothing, and others a series of values.", "tool_function": "Templating Languages & Extensions"}, {"name": "HTML5", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "5th major revision of the core language of the World Wide Web", "description": "HTML5 is a core technology markup language of the Internet used for structuring and presenting content for the World Wide Web. As of October 2014 this is the final and complete fifth revision of the HTML standard of the World Wide Web Consortium (W3C). The previous version, HTML 4, was standardised in 1997.", "tool_function": "Languages"}, {"name": "Scala", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A pure-bred object-oriented language that runs on the JVM", "description": "Scala is an acronym for “Scalable Language”. This means that Scala grows with you. You can play with it by typing one-line expressions and observing the results. But you can also rely on it for large mission critical systems, as many companies, including Twitter, LinkedIn, or Intel do. To some, Scala feels like a scripting language. Its syntax is concise and low ceremony; its types get out of the way because the compiler can infer them. ", "tool_function": "Languages"}, {"name": "ES6", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The next version of JavaScript", "description": "Goals for ECMAScript 2015 include providing better support for large applications, library creation, and for use of ECMAScript as a compilation target for other languages. Some of its major enhancements include modules, class declarations, lexical block scoping, iterators and generators, promises for asynchronous programming, destructuring patterns, and proper tail calls.", "tool_function": "Languages"}, {"name": "Microsoft SQL Server", "category": "Application and Data", "subcategory": "Data Stores", "title": "A relational database management system developed by Microsoft", "description": "Microsoft® SQL Server is a database management and analysis system for e-commerce, line-of-business, and data warehousing solutions. ", "tool_function": "Databases"}, {"name": "Laravel", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A PHP Framework For Web Artisans", "description": "It is a web application framework with expressive, elegant syntax. It attempts to take the pain out of development by easing common tasks used in the majority of web projects, such as authentication, routing, sessions, and caching.", "tool_function": "Frameworks (Full Stack)"}, {"name": "Redis", "category": "Application and Data", "subcategory": "Data Stores", "title": "Open source (BSD licensed), in-memory data structure store", "description": "Redis is an open source (BSD licensed), in-memory data structure store, used as a database, cache, and message broker. Redis provides data structures such as strings, hashes, lists, sets, sorted sets with range queries, bitmaps, hyperloglogs, geospatial indexes, and streams.", "tool_function": "In-Memory Databases"}, {"name": "Lodash", "category": "Application and Data", "subcategory": "Libraries", "title": "A JavaScript utility library", "description": "A JavaScript utility library delivering consistency, modularity, performance, & extras. It provides utility functions for common programming tasks using the functional programming paradigm.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Google Drive", "category": "Application and Data", "subcategory": "Assets and Media", "title": "A safe place for all your files", "description": "Keep photos, stories, designs, drawings, recordings, videos, and more. Your first 15 GB of storage are free with a Google Account. Your files in Drive can be reached from any smartphone, tablet, or computer.", "tool_function": "File Storage"}, {"name": "DataTables", "category": "Application and Data", "subcategory": "Libraries", "title": "A plug-in for the jQuery Javascript library", "description": "It is a highly flexible tool, built upon the foundations of progressive enhancement, that adds all of these advanced features to any HTML table.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Kafka", "category": "Application and Data", "subcategory": "Data Stores", "title": "Distributed, fault tolerant, high throughput pub-sub messaging system", "description": "Kafka is a distributed, partitioned, replicated commit log service. It provides the functionality of a messaging system, but with a unique design.", "tool_function": "Message Queue"}, {"name": "Select2", "category": "Application and Data", "subcategory": "Libraries", "title": "The jQuery replacement for select boxes", "description": "It gives you a customizable select box with support for searching, tagging, remote data sets, infinite scrolling, and many other highly used options. It comes with support for RTL environments, searching with diacritics and over 40 languages built-in.", "tool_function": "Javascript UI Libraries"}, {"name": "Amazon DynamoDB", "category": "Application and Data", "subcategory": "Data Stores", "title": "Fully managed NoSQL database service", "description": "With it , you can offload the administrative burden of operating and scaling a highly available distributed database cluster, while paying a low price for only what you use.", "tool_function": "NoSQL Database as a Service"}, {"name": "Android SDK", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "An SDK that provides you the API libraries and developer tools necessary to build, test, and debug apps for Android.", "description": "Android provides a rich application framework that allows you to build innovative apps and games for mobile devices in a Java language environment.", "tool_function": "Frameworks (Full Stack)"}, {"name": "Swift", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "An innovative new programming language for Cocoa and Cocoa Touch. ", "description": "Writing code is interactive and fun, the syntax is concise yet expressive, and apps run lightning-fast. Swift is ready for your next iOS and OS X project — or for addition into your current app — because Swift code works side-by-side with Objective-C.", "tool_function": "Languages"}, {"name": "Kotlin", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Statically typed Programming Language targeting JVM and JavaScript", "description": "Kotlin is a statically typed programming language for the JVM, Android and the browser, 100% interoperable with Java", "tool_function": "Languages"}, {"name": "Amazon Redshift", "category": "Application and Data", "subcategory": "Data Stores", "title": "Fast, fully managed, petabyte-scale data warehouse service", "description": "It is optimized for data sets ranging from a few hundred gigabytes to a petabyte or more and costs less than $1,000 per terabyte per year, a tenth the cost of most traditional data warehousing solutions.", "tool_function": "Big Data as a Service"}, {"name": "Objective-C", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The primary programming language you use when writing software for OS X and iOS", "description": "Objective-C is a superset of the C programming language and provides object-oriented capabilities and a dynamic runtime. Objective-C inherits the syntax, primitive types, and flow control statements of C and adds syntax for defining classes and methods. It also adds language-level support for object graph management and object literals while providing dynamic typing and binding, deferring many responsibilities until runtime.", "tool_function": "Languages"}, {"name": "MongoDB", "category": "Application and Data", "subcategory": "Data Stores", "title": "The database for giant ideas", "description": "MongoDB stores data in JSON-like documents that can vary in structure, offering a dynamic, flexible schema. MongoDB was also designed for high availability and scalability, with built-in replication and auto-sharding.", "tool_function": "Databases"}, {"name": "Prototype", "category": "Application and Data", "subcategory": "Libraries", "title": "Prototype JavaScript framework", "description": "Prototype is a JavaScript framework that aims to ease development of dynamic web applications. It offers a familiar class-style OO framework, extensive Ajax support, higher-order programming constructs, and easy DOM manipulation.", "tool_function": "Javascript UI Libraries"}, {"name": "Chart.js", "category": "Application and Data", "subcategory": "Libraries", "title": "Simple, clean and engaging charts for designers and developers", "description": "Visualize your data in 6 different ways. Each of them animated, with a load of customisation options and interactivity extensions.", "tool_function": "Charting Libraries"}, {"name": "Passenger", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A fast and robust web server and application server for Ruby, Python and Node.js", "description": "Phusion Passenger is a web server and application server, designed to be fast, robust and lightweight. It takes a lot of complexity out of deploying web apps, adds powerful enterprise-grade features that are useful in production, and makes administration much easier and less complex.", "tool_function": "Web Servers"}, {"name": "Groovy", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A multi-faceted language for the Java platform", "description": "It is a powerful multi-faceted programming language for the JVM platform. It supports a spectrum of programming styles incorporating features from dynamic languages such as optional and duck typing, but also static compilation and static type checking at levels similar to or greater than Java through its extensible static type checker. It aims to greatly increase developer productivity with many powerful features but also a concise, familiar and easy to learn syntax.", "tool_function": "Languages"}, {"name": "clipboard.js", "category": "Application and Data", "subcategory": "Libraries", "title": "A modern approach to copy text to clipboard", "description": "Copying text to the clipboard shouldn't be hard. It shouldn't require dozens of steps to configure or hundreds of KBs to load. But most of all, it shouldn't depend on Flash or any bloated framework. That's why this tool exists.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Fastly", "category": "Application and Data", "subcategory": "Assets and Media", "title": "We're redefining content delivery.", "description": "Fastly's real-time content delivery network gives you total control over your content, unprecedented access to performance analytics, and the ability to instantly update content in 150 milliseconds.", "tool_function": "Content Delivery Network"}, {"name": "C lang", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "One of the most widely used programming languages of all time", "description": null, "tool_function": "Languages"}, {"name": "Spring", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Provides a comprehensive programming and configuration model for modern Java-based enterprise applications", "description": "A key element of Spring is infrastructural support at the application level: Spring focuses on the \"plumbing\" of enterprise applications so that teams can focus on application-level business logic, without unnecessary ties to specific deployment environments.", "tool_function": "Frameworks (Full Stack)"}, {"name": "C++", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Has imperative, object-oriented and generic programming features, while also providing the facilities for low level memory manipulation", "description": "C++ compiles directly to a machine's native code, allowing it to be one of the fastest languages in the world, if optimized.", "tool_function": "Languages"}, {"name": "RabbitMQ", "category": "Application and Data", "subcategory": "Data Stores", "title": "Open source multiprotocol messaging broker", "description": "RabbitMQ gives your applications a common platform to send and receive messages, and your messages a safe place to live until received.", "tool_function": "Message Queue"}, {"name": "Django", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The Web framework for perfectionists with deadlines", "description": "Django is a high-level Python Web framework that encourages rapid development and clean, pragmatic design.", "tool_function": "Frameworks (Full Stack)"}, {"name": "PowerShell", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A task automation and configuration management framework", "description": "A command-line shell and scripting language built on .NET. Helps system administrators and power-users rapidly automate tasks that manage operating systems (Linux, macOS, and Windows) and processes. ", "tool_function": "Shells"}, {"name": "GraphQL", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A data query language and runtime", "description": "GraphQL is a data query language and runtime designed and used at Facebook to request and deliver data to mobile and web apps since 2012.", "tool_function": "Query Languages"}, {"name": "Material Design for Angular", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Material Design for AngularJS Apps", "description": "Material Design is a specification for a unified system of visual, motion, and interaction design that adapts across different devices. Our goal is to deliver a lean, lightweight set of AngularJS-native UI elements that implement the material design system for use in Angular SPAs.", "tool_function": "Front-End Frameworks"}, {"name": "AWS Lambda", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Automatically run code in response to modifications to objects in Amazon S3 buckets, messages in Kinesis streams, or updates in DynamoDB", "description": "AWS Lambda is a compute service that runs your code in response to events and automatically manages the underlying compute resources for you. You can use AWS Lambda to extend other AWS services with custom logic, or create your own back-end services that operate at AWS scale, performance, and security.", "tool_function": "Serverless / Task Processing"}, {"name": "Ember.js", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A JavaScript framework for creating ambitious web apps", "description": "A JavaScript framework that does all of the heavy lifting that you'd normally have to do by hand. There are tasks that are common to every web app; It does those things for you, so you can focus on building killer features and UI.", "tool_function": "Javascript MVC Frameworks"}, {"name": "videojs", "category": "Application and Data", "subcategory": "Libraries", "title": "Open source library for working with video ", "description": "It is an open source library for working with video on the web, also known as an HTML video player. It supports HTML5 and Flash video, as well as YouTube and Vimeo (through plugins). It supports video playback on desktops and mobile devices.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "CakePHP", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The Rapid Development Framework for PHP", "description": "It makes building web applications simpler, faster, while requiring less code. A modern PHP 7 framework offering a flexible database access layer and a powerful scaffolding system.", "tool_function": "Frameworks (Full Stack)"}, {"name": "SQLite", "category": "Application and Data", "subcategory": "Data Stores", "title": "A software library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine", "description": "SQLite is an embedded SQL database engine. Unlike most other SQL databases, SQLite does not have a separate server process. SQLite reads and writes directly to ordinary disk files. A complete SQL database with multiple tables, indices, triggers, and views, is contained in a single disk file.", "tool_function": "Databases"}, {"name": "Amazon RDS", "category": "Application and Data", "subcategory": "Data Stores", "title": "Set up, operate, and scale a relational database in the cloud.", "description": "Amazon RDS gives you access to the capabilities of a familiar MySQL, Oracle or Microsoft SQL Server database engine. This means that the code, applications, and tools you already use today with your existing databases can be used with Amazon RDS. Amazon RDS automatically patches the database software and backs up your database, storing the backups for a user-defined retention period and enabling point-in-time recovery. You benefit from the flexibility of being able to scale the compute resources or storage capacity associated with your Database Instance (DB Instance) via a single API call.", "tool_function": "SQL Database as a Service"}, {"name": "three.js", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A JavaScript 3D library", "description": "It is a cross-browser JavaScript library and Application Programming Interface used to create and display animated 3D computer graphics in a web browser.", "tool_function": "Game Development"}, {"name": "Dropbox", "category": "Application and Data", "subcategory": "Assets and Media", "title": "Build the power of Dropbox into your apps", "description": "Harness the power of Dropbox. Connect to an account, upload, download, search, and more.", "tool_function": "File Storage"}, {"name": "Socket.IO", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Realtime application framework (Node.JS server)", "description": "It enables real-time bidirectional event-based communication. It works on every platform, browser or device, focusing equally on reliability and speed.", "tool_function": "Realtime Backend / API"}, {"name": "Sass", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Syntactically Awesome Style Sheets", "description": "Sass is an extension of CSS3, adding nested rules, variables, mixins, selector inheritance, and more. It's translated to well-formatted, standard CSS using the command line tool or a web-framework plugin.", "tool_function": "CSS Pre-processors / Extensions"}, {"name": "ActiveMQ", "category": "Application and Data", "subcategory": "Data Stores", "title": "A message broker written in Java together with a full JMS client", "description": "Apache ActiveMQ is fast, supports many Cross Language Clients and Protocols, comes with easy to use Enterprise Integration Patterns and many advanced features while fully supporting JMS 1.1 and J2EE 1.4. Apache ActiveMQ is released under the Apache 2.0 License.", "tool_function": "Message Queue"}, {"name": "CodeIgniter", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A Fully Baked PHP Framework", "description": "CodeIgniter is a proven, agile & open PHP web application framework with a small footprint. It is powering the next generation of web apps.", "tool_function": "Frameworks (Full Stack)"}, {"name": "Raphael", "category": "Application and Data", "subcategory": "Libraries", "title": "JavaScript library that draws Vector graphics for web sites", "description": "It is a cross-browser JavaScript library that draws Vector graphics for web sites. It will use SVG for most browsers, but will use VML for older versions of Internet Explorer.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "CKEditor", "category": "Application and Data", "subcategory": "Libraries", "title": "A modern, feature-rich JavaScript text editor", "description": "It is a modern, feature-rich JavaScript text editor with clean UI and perfect UX. Easily customizable to any use case.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "TinyMCE", "category": "Application and Data", "subcategory": "Libraries", "title": "JavaScript library for rich text editing", "description": "It is the most advanced WYSWIYG HTML editor designed to simplify website content creation. The rich text editing platform that helped launch Atlassian, Medium, Evernote, and more.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Hadoop", "category": "Application and Data", "subcategory": "Data Stores", "title": "Open-source software for reliable, scalable, distributed computing", "description": "The Apache Hadoop software library is a framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models. It is designed to scale up from single servers to thousands of machines, each offering local computation and storage.", "tool_function": "Databases"}, {"name": "Flask", "category": "Application and Data", "subcategory": "Libraries", "title": "A simple framework for building complex web applications", "description": "A simple framework for building complex web applications.", "tool_function": "PyPI Packages"}, {"name": "Dojo", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A Progressive TypeScript Framework for Modern Web Apps", "description": "It is a JavaScript toolkit that saves you time and scales with your development process. Provides everything you need to build a Web app. Language utilities, UI components, and more, all in one place, designed to work together perfectly.", "tool_function": "Front-End Frameworks"}, {"name": "CoffeeScript", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A little language that compiles into JavaScript", "description": "It adds syntactic sugar inspired by Ruby, Python and Haskell in an effort to enhance JavaScript's brevity and readability. Specific additional features include list comprehension and de-structuring assignment.", "tool_function": "Languages"}, {"name": "Oracle", "category": "Application and Data", "subcategory": "Data Stores", "title": "An RDBMS that implements object-oriented features such as user-defined types, inheritance, and polymorphism", "description": "Oracle Database is an RDBMS. An RDBMS that implements object-oriented features such as user-defined types, inheritance, and polymorphism is called an object-relational database management system (ORDBMS). Oracle Database has extended the relational model to an object-relational model, making it possible to store complex business models in a relational database.", "tool_function": "Databases"}, {"name": "Smalltalk", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "An object-oriented, dynamically typed reflective programming language", "description": "It is an object-oriented, dynamically typed reflective programming language. It was created as the language underpinning the \"new world\" of computing exemplified by \"human–computer symbiosis\". It was designed and created in part for educational use, specifically for constructionist learning.", "tool_function": "Languages"}, {"name": "Prism", "category": "Application and Data", "subcategory": "Libraries", "title": "An extensible syntax highlighter, built with modern web standards", "description": "It is a lightweight, beautiful and extensible syntax highlighter, built with modern web standards in mind. It’s used in thousands of websites, including some of those you visit daily.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "LiteSpeed", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A drop-in Apache replacement and the leading high-performance, high-scalability server ", "description": "It is a drop-in Apache replacement and the leading high-performance, high-scalability server. You can replace your existing Apache server with it without changing your configuration or operating system details. As a drop-in replacement, it allows you to quickly eliminate Apache bottlenecks in 15 minutes with zero downtime. ", "tool_function": "Web Servers"}, {"name": "Lua", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Powerful, fast, lightweight, embeddable scripting language", "description": "Lua combines simple procedural syntax with powerful data description constructs based on associative arrays and extensible semantics. Lua is dynamically typed, runs by interpreting bytecode for a register-based virtual machine, and has automatic memory management with incremental garbage collection, making it ideal for configuration, scripting, and rapid prototyping.", "tool_function": "Languages"}, {"name": "Plesk", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A web hosting platform with a control panel ", "description": "Build and manage multiple sites from a single dashboard. You can also run updates, monitor performance and onboard new prospects all from the same place. It is a WebOps platform to run, automate and grow applications, websites and hosting businesses. ", "tool_function": "Control Panels"}, {"name": "Cassandra", "category": "Application and Data", "subcategory": "Data Stores", "title": "A partitioned row store. Rows are organized into tables with a required primary key.", "description": "Partitioning means that Cassandra can distribute your data across multiple machines in an application-transparent matter. Cassandra will automatically repartition as machines are added and removed from the cluster. Row store means that like relational databases, Cassandra organizes data by rows and columns. The Cassandra Query Language (CQL) is a close relative of SQL.", "tool_function": "Databases"}, {"name": "Kendo UI", "category": "Application and Data", "subcategory": "Libraries", "title": "Fast, light, complete: 70+ jQuery-based UI widgets in one powerful toolset", "description": "Fast, light, complete: 70+ jQuery-based UI widgets in one powerful toolset. AngularJS integration, Bootstrap support, mobile controls, offline data solution.", "tool_function": "Javascript UI Libraries"}, {"name": "Google BigQuery", "category": "Application and Data", "subcategory": "Data Stores", "title": "Analyze terabytes of data in seconds", "description": "Run super-fast, SQL-like queries against terabytes of data in seconds, using the processing power of Google's infrastructure.\r\nLoad data with ease. Bulk load your data using Google Cloud Storage or stream it in.\r\nEasy access. Access BigQuery by using a browser tool, a command-line tool, or by making calls to the BigQuery REST API with client libraries such as Java, PHP or Python.", "tool_function": "Big Data as a Service"}, {"name": "Spring Boot", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Create Spring-powered, production-grade applications and services with absolute minimum fuss", "description": "Spring Boot makes it easy to create stand-alone, production-grade Spring based Applications that you can \"just run\". We take an opinionated view of the Spring platform and third-party libraries so you can get started with minimum fuss. Most Spring Boot applications need very little Spring configuration.", "tool_function": "Frameworks (Full Stack)"}, {"name": "Amazon SQS", "category": "Application and Data", "subcategory": "Data Stores", "title": "Fully managed message queuing service", "description": "Transmit any volume of data, at any level of throughput, without losing messages or requiring other services to be always available. With SQS, you can offload the administrative burden of operating and scaling a highly available messaging cluster, while paying a low price for only what you use.", "tool_function": "Message Queue"}, {"name": "MapStruct", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A Java code generator for creating fast and type-safe bean mappings at compile time", "description": "It is a code generator that greatly simplifies the implementation of mappings between Java bean types based on a convention over configuration approach. The generated mapping code uses plain method invocations and thus is fast, type-safe and easy to understand.", "tool_function": "Java Tools"}, {"name": "Perl", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Highly capable, feature-rich programming language with over 26 years of development", "description": "Perl is a general-purpose programming language originally developed for\r\ntext manipulation and now used for a wide range of tasks including\r\nsystem administration, web development, network programming, GUI\r\ndevelopment, and more.", "tool_function": "Languages"}, {"name": "Debian", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The Universal Operating System", "description": "Debian systems currently use the Linux kernel or the FreeBSD kernel. Linux is a piece of software started by Linus Torvalds and supported by thousands of programmers worldwide. FreeBSD is an operating system including a kernel and other software.", "tool_function": "Operating Systems"}, {"name": "Visual Basic", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Modern, high-level, multi-paradigm, general-purpose programming language for building apps using Visual Studio and the .NET Framework", "description": "Visual Basic is derived from BASIC and enables the rapid application development (RAD) of graphical user interface (GUI) applications, access to databases using Data Access Objects, Remote Data Objects, or ActiveX Data Objects, and creation of ActiveX controls and objects.", "tool_function": "Languages"}, {"name": "Immutables", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Java annotation processors to generate simple, safe and consistent value objects", "description": "Generate state of the art immutable objects and builders. Type-safe, null-safe, and thread-safe, with no boilerplate. Generate builders for immutable objects and even plain static factory methods.", "tool_function": "Java Tools"}, {"name": "Lombok", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Get rid of boilerplate code, Spice up your java", "description": "It is a java library that automatically plugs into your editor and build tools, spicing up your java.\nNever write another getter or equals method again, with one annotation your class has a fully featured builder, Automate your logging variables, and much more.", "tool_function": "Java Tools"}, {"name": "Amazon VPC", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Provision a logically isolated section of the AWS Cloud and launch AWS resources in a virtual network that you define", "description": "You have complete control over your virtual networking environment, including selection of your own IP address range, creation of subnets, and configuration of route tables and network gateways. You can easily customize the network configuration for your Amazon VPC.", "tool_function": "Virtual Private Cloud"}, {"name": "NVD3", "category": "Application and Data", "subcategory": "Libraries", "title": "Re-usable charts for d3.js", "description": "This project is an attempt to build re-usable charts and chart components for d3.js without taking away the power that d3.js gives you. This is a very young collection of components, with the goal of keeping these components very customizable, staying away from your standard cookie cutter solutions.", "tool_function": "Charting Libraries"}, {"name": "Liquibase", "category": "Application and Data", "subcategory": "Data Stores", "title": "Easily track, version & deploy database changes", "description": "Liquibase is th leading open-source tool for database schema change management. Liquibase helps teams track, version, and deploy database schema and logic changes so they can automate their database code process with their app code process.", "tool_function": "Database Tools"}, {"name": "Memcached", "category": "Application and Data", "subcategory": "Data Stores", "title": "High-performance, distributed memory object caching system", "description": "Memcached is an in-memory key-value store for small chunks of arbitrary data (strings, objects) from results of database calls, API calls, or page rendering.", "tool_function": "Databases"}, {"name": "Google App Engine", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Build web applications on the same scalable systems that power Google applications", "description": "Google has a reputation for highly reliable, high performance infrastructure. With App Engine you can take advantage of the 10 years of knowledge Google has in running massively scalable, performance driven systems. App Engine applications are easy to build, easy to maintain, and easy to scale as your traffic and data storage needs grow. ", "tool_function": "Platform as a Service"}, {"name": "MooTools", "category": "Application and Data", "subcategory": "Libraries", "title": "A compact JavaScript framework ", "description": "It is a collection of JavaScript utilities designed for the intermediate to advanced JavaScript developer. It allows you to write powerful and flexible code with its elegant, well documented, and coherent APIs.", "tool_function": "Javascript Utilities & Libraries"}, {"name": "UIkIt", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A lightweight and modular front-end framework for developing fast and powerful web interfaces", "description": "UIkit gives you a comprehensive collection of HTML, CSS, and JS components\r\nwhich is simple to use, easy to customize and extendable.", "tool_function": "Front-End Frameworks"}, {"name": "OCaml", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A general purpose industrial-strength programming language", "description": "It is an industrial strength programming language supporting functional, imperative and object-oriented styles. It is the technology of choice in companies where a single mistake can cost millions and speed matters, ", "tool_function": "Languages"}, {"name": "Java 8", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A development environment for building applications ", "description": "It is a revolutionary release of the world’s no 1 development platform. It includes a huge upgrade to the Java programming model and a coordinated evolution of the JVM, Java language, and libraries. Java 8 includes features for productivity, ease of use, improved polyglot programming, security and improved performance.", "tool_function": "Java Tools"}, {"name": "ExpressJS", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Sinatra inspired web development framework for node.js -- insanely fast, flexible, and simple", "description": "Express is a minimal and flexible node.js web application framework, providing a robust set of features for building single and multi-page, and hybrid web applications.", "tool_function": "Microframeworks (Backend)"}, {"name": "Splunk", "category": "Application and Data", "subcategory": "Data Stores", "title": "Search, monitor, analyze and visualize machine data", "description": "It provides the leading platform for Operational Intelligence. Customers use it to search, monitor, analyze and visualize machine data.", "tool_function": "Big Data Tools"}, {"name": "Empire", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A Self-Hosted PaaS Built on Docker and Amazon ECS", "description": "Empire is a control layer on top of Amazon EC2 Container Service (ECS) that provides a Heroku like workflow. It conforms to a subset of the Heroku Platform API, which means you can use the same tools and processes that you use with Heroku, but with all the power of EC2 and Docker.", "tool_function": "Platform as a Service"}, {"name": "Apache Spark", "category": "Application and Data", "subcategory": "Data Stores", "title": "Fast and general engine for large-scale data processing", "description": "Spark is a fast and general processing engine compatible with Hadoop data. It can run in Hadoop clusters through YARN or Spark's standalone mode, and it can process data in HDFS, HBase, Cassandra, Hive, and any Hadoop InputFormat. It is designed to perform both batch processing (similar to MapReduce) and new workloads like streaming, interactive queries, and machine learning.", "tool_function": "Big Data Tools"}, {"name": "Camunda", "category": "Application and Data", "subcategory": "Data Stores", "title": "The Universal Process Orchestrator", "description": "With Camunda, business users collaborate with developers to model and automate end-to-end processes using BPMN-powered flowcharts that run with the speed, scale, and resiliency required to compete in today’s digital-first world", "tool_function": "Workflow Manager"}, {"name": "Azure Storage", "category": "Application and Data", "subcategory": "Data Stores", "title": "Reliable, economical cloud storage for data big and small", "description": "Azure Storage provides the flexibility to store and retrieve large amounts of unstructured data, such as documents and media files with Azure Blobs; structured nosql based data with Azure Tables; reliable messages with Azure Queues, and use SMB based Azure Files for migrating on-premises applications to the cloud.", "tool_function": "Cloud Storage"}, {"name": "mod_perl", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A persistent Perl interpreter embedded in your web server", "description": "It brings together the full power of the Perl programming language and the Apache HTTP server. You can use Perl to manage Apache, respond to requests for web pages and much more.", "tool_function": "Language Runtimes"}, {"name": "Markdown", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Text-to-HTML conversion tool/syntax for web writers, by John Gruber", "description": "Markdown is two things: (1) a plain text formatting syntax; and (2) a software tool, written in Perl, that converts the plain text formatting to HTML. ", "tool_function": "Languages"}, {"name": "ClearDB", "category": "Application and Data", "subcategory": "Data Stores", "title": "Fault tolerant database-as-a-service in the cloud for your MySQL powered applications.", "description": "ClearDB uses a combination of advanced replication techniques, advanced cluster technology, and layered web services to provide you with a MySQL database that is \"smarter\" than usual.", "tool_function": "SQL Database as a Service"}, {"name": "Cloudant", "category": "Application and Data", "subcategory": "Data Stores", "title": "Distributed database-as-a-service (DBaaS) for web & mobile apps", "description": "Cloudant’s distributed database as a service (DBaaS) allows developers of fast-growing web and mobile apps to focus on building and improving their products, instead of worrying about scaling and managing databases on their own.", "tool_function": "NoSQL Database as a Service"}, {"name": "OneDrive", "category": "Application and Data", "subcategory": "Assets and Media", "title": "Save your files and photos to OneDrive and get them from any device, anywhere", "description": "Outlook.com is a free, personal email service from Microsoft. Keep your inbox clutter-free with powerful organizational tools, and collaborate easily with OneDrive and Office Online integration.", "tool_function": "File Storage"}, {"name": "built.io", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Idea to app in record time", "description": "Built.io Backend is an mBaaS that allows you to avoid designing, building, and supporting a custom backend for your mobile & web applications. Enterprises can dramatically reduce cost, lower risk and accelerate time-to-market for apps.", "tool_function": "Mobile Backend"}, {"name": "JSON API", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "One of many data formats that is often applied to REST", "description": "It is most widely used data format for data interchange on the web. This data interchange can happen between two computers applications at different geographical locations or running within same hardware machine.", "tool_function": "Query Languages"}, {"name": "Amazon ElastiCache", "category": "Application and Data", "subcategory": "Data Stores", "title": "Deploy, operate, and scale an in-memory cache in the cloud", "description": "ElastiCache improves the performance of web applications by allowing you to retrieve information from fast, managed, in-memory caches, instead of relying entirely on slower disk-based databases. ElastiCache supports Memcached and Redis.", "tool_function": "Managed Memcache"}, {"name": "Red Hat OpenShift", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Red Hat's free Platform as a Service (PaaS) for hosting Java, PHP, Ruby, Python, Node.js, and Perl apps", "description": "OpenShift is Red Hat's Cloud Computing Platform as a Service (PaaS) offering. OpenShift is an application platform in the cloud where application developers and teams can build, test, deploy, and run their applications.", "tool_function": "Platform as a Service"}, {"name": "Foundation", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The most advanced responsive  front-end framework in the world", "description": "Foundation is the most advanced responsive front-end framework in the world. You can quickly prototype and build sites or apps that work on any kind of device with Foundation, which includes layout constructs (like a fully responsive grid), elements and best practices.", "tool_function": "Front-End Frameworks"}, {"name": "Jetty", "category": "Application and Data", "subcategory": "Application Hosting", "title": "An open-source project providing an HTTP server, HTTP client, and javax.servlet container", "description": "Jetty is used in a wide variety of projects and products, both in development and production. Jetty can be easily embedded in devices, tools, frameworks, application servers, and clusters. See the Jetty Powered page for more uses of Jetty.", "tool_function": "Web Servers"}, {"name": "Helm", "category": "Application and Data", "subcategory": "Libraries", "title": "The Kubernetes Package Manager", "description": "Helm is the best way to find, share, and use software built for Kubernetes.", "tool_function": "Helm Charts"}, {"name": "lighttpd", "category": "Application and Data", "subcategory": "Application Hosting", "title": "A secure, fast, compliant, and very flexible web-server that has been optimized for high-performance environments", "description": "lighttpd has a very low memory footprint compared to other webservers and takes care of cpu-load. Its advanced feature-set (FastCGI, CGI, Auth, Output-Compression, URL-Rewriting and many more) make lighttpd the perfect webserver-software for every server that suffers load problems.", "tool_function": "Web Servers"}, {"name": "imgix", "category": "Application and Data", "subcategory": "Assets and Media", "title": "Optimize, manage, and deliver images and videos for faster pages, better visual quality, and a simpler workflow.", "description": "imgix is the leading visual media platform that businesses choose to improve user experience, website performance, and cost-saving. imgix offers robust image and video processing, global content delivery, and intelligent asset management.", "tool_function": "Image Processing and Management"}, {"name": "RxJS", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "The Reactive Extensions for JavaScript", "description": "RxJS is a library for reactive programming using Observables, to make it easier to compose asynchronous or callback-based code. This project is a rewrite of Reactive-Extensions/RxJS with better performance, better modularity, better debuggable call stacks, while staying mostly backwards compatible, with some breaking changes that reduce the API surface.", "tool_function": "Concurrency Frameworks"}, {"name": "Apache Thrift", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Software framework for scalable cross-language services development", "description": "The Apache Thrift software framework, for scalable cross-language services development, combines a software stack with a code generation engine to build services that work efficiently and seamlessly between C++, Java, Python, PHP, Ruby, Erlang, Perl, Haskell, C#, Cocoa, JavaScript, Node.js, Smalltalk, OCaml and Delphi and other languages.", "tool_function": "Serialization Frameworks"}, {"name": "Apollo", "category": "Application and Data", "subcategory": "Application Hosting", "title": "GraphQL server for Express, Connect, Hapi, Koa and more", "description": "Build a universal GraphQL API on top of your existing REST APIs, so you can ship new application features fast without waiting on backend changes.", "tool_function": "Platform as a Service"}, {"name": "Cobertura", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A code coverage utility for Java", "description": "It is a free Java tool that calculates the percentage of code accessed by tests. It can be used to identify which parts of your Java program are lacking test coverage.", "tool_function": "Java Tools"}, {"name": "Amazon Aurora", "category": "Application and Data", "subcategory": "Data Stores", "title": "MySQL and PostgreSQL compatible relational database with several times better performance", "description": "Amazon Aurora is a MySQL-compatible, relational database engine that combines the speed and availability of high-end commercial databases with the simplicity and cost-effectiveness of open source databases. Amazon Aurora provides up to five times better performance than MySQL at a price point one tenth that of a commercial database while delivering similar performance and availability.", "tool_function": "SQL Database as a Service"}, {"name": "Vitess", "category": "Application and Data", "subcategory": "Data Stores", "title": "A database clustering system for horizontal scaling of MySQL", "description": "It is a database solution for deploying, scaling and managing large clusters of MySQL instances. It’s architected to run as effectively in a public or private cloud architecture as it does on dedicated hardware. It combines and extends many important MySQL features with the scalability of a NoSQL database.", "tool_function": "Databases"}, {"name": "Hibernate", "category": "Application and Data", "subcategory": "Data Stores", "title": "Idiomatic persistence for Java and relational databases.", "description": "Hibernate is a suite of open source projects around domain models. The flagship project is Hibernate ORM, the Object Relational Mapper.", "tool_function": "Object Relational Mapper (ORM)"}, {"name": "Google Cloud SQL", "category": "Application and Data", "subcategory": "Data Stores", "title": "Fully managed relational database service for MySQL, PostgreSQL, and SQL Server. ", "description": "Run the same relational databases you know with their rich extension collections, configuration flags and developer ecosystem, but without the hassle of self management.", "tool_function": "SQL Database as a Service"}, {"name": "Firebase", "category": "Application and Data", "subcategory": "Application Hosting", "title": "The Realtime App Platform", "description": "Firebase is a cloud service designed to power real-time, collaborative applications. Simply add the Firebase library to your application to gain access to a shared data structure; any changes you make to that data are automatically synchronized with the Firebase cloud and with other clients within milliseconds.", "tool_function": "Realtime Backend / API"}, {"name": "HBase", "category": "Application and Data", "subcategory": "Data Stores", "title": "The Hadoop database, a distributed, scalable, big data store", "description": "Apache HBase is an open-source, distributed, versioned, column-oriented store modeled after Google' Bigtable: A Distributed Storage System for Structured Data by Chang et al. Just as Bigtable leverages the distributed data storage provided by the Google File System, HBase provides Bigtable-like capabilities on top of Apache Hadoop.", "tool_function": "Databases"}, {"name": "Electron", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Build cross platform desktop apps with JavaScript, HTML, and CSS", "description": "With Electron, creating a desktop application for your company or idea is easy. Initially developed for GitHub's Atom editor, Electron has since been used to create applications by companies like Microsoft, Facebook, Slack, and Docker. The Electron framework lets you write cross-platform desktop applications using JavaScript, HTML and CSS. It is based on io.js and Chromium and is used in the Atom editor.", "tool_function": "Cross-Platform Desktop Development"}, {"name": "Resque", "category": "Application and Data", "subcategory": "Data Stores", "title": "A Redis-backed Ruby library for creating background jobs, placing them on multiple queues, and processing them later", "description": "Background jobs can be any Ruby class or module that responds to perform. Your existing classes can easily be converted to background jobs or you can create new classes specifically to do work. Or, you can do both.", "tool_function": "Background Processing"}, {"name": "Yii", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A high-performance PHP framework best for developing Web 2.0 applications", "description": "Yii comes with: MVC, DAO/ActiveRecord, I18N/L10N, caching, authentication and role-based access control, scaffolding, testing, etc. It can reduce your development time significantly.", "tool_function": "Frameworks (Full Stack)"}, {"name": "dbt", "category": "Application and Data", "subcategory": "Data Stores", "title": "dbt helps data teams work like software engineers—to ship trusted data, faster.", "description": "dbt is a transformation workflow that lets teams deploy analytics code following software engineering best practices like modularity, portability, CI/CD, and documentation. Now anyone who knows SQL can build production-grade data pipelines.", "tool_function": "Database Tools"}, {"name": "MaxCDN", "category": "Application and Data", "subcategory": "Assets and Media", "title": "Our CDN makes your site load faster!", "description": "The MaxCDN Content Delivery Network efficiently delivers your site’s static file through hundreds of servers instead of slogging through a single host. This \"smart route\" technology distributes your content to your visitors via the city closest to them.", "tool_function": "Content Delivery Network"}, {"name": "Quarkus", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A Kubernetes Native Java stack tailored for OpenJDK HotSpot and GraalVM, crafted from the best of breed Java libraries and standards", "description": "It tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.", "tool_function": "Java Tools"}, {"name": "guava", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Google Core Libraries for Java 6+", "description": "The Guava project contains several of Google's core libraries that we rely on in our Java-based projects: collections, caching, primitives support, concurrency libraries, common annotations, string processing, I/O, and so forth.", "tool_function": "Java Tools"}, {"name": "Windows Server", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A Microsoft product and a brand name for a group of server operating systems", "description": "It is a brand name for a group of server operating systems released by Microsoft. It includes all Windows operating systems, Increase security, evolve your data center, and innovate faster with Microsoft Windows Server, the cloud-ready operating system.", "tool_function": "Operating Systems"}, {"name": "Cloud Foundry", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Deploy and scale applications in seconds on your choice of private or public cloud", "description": "Cloud Foundry is an open platform as a service (PaaS) that provides a choice of clouds, developer frameworks, and application services. Cloud Foundry makes it faster and easier to build, test, deploy, and scale applications.", "tool_function": "Platform as a Service"}, {"name": "WinSCP", "category": "Application and Data", "subcategory": "Assets and Media", "title": "A popular SFTP client and FTP client for Microsoft Windows", "description": "It is a popular SFTP client and FTP client for Microsoft Windows. Copy file between a local computer and remote servers using FTP, FTPS, SCP, SFTP, WebDAV or S3 file transfer protocols.", "tool_function": "File Transfer"}, {"name": "jFrog", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Universal Artifact Management", "description": "Host, manage and proxy artifacts using the best Docker Registry, Maven Repository, Gradle repository, NuGet repository, Ruby repository, Debian repository npm repository, Yum repository.", "tool_function": "Platform as a Service"}, {"name": "Google Code Prettify", "category": "Application and Data", "subcategory": "Libraries", "title": "An embeddable script that makes source-code snippets in HTML prettier", "description": "It is an embeddable script that makes source-code snippets in HTML prettier.It works on HTML pages. It is widely used with good cross-browser support. ", "tool_function": "Javascript Utilities & Libraries"}, {"name": "Matillion", "category": "Application and Data", "subcategory": "Data Stores", "title": "An ETL Tool for BigData", "description": "It is a modern, browser-based UI, with powerful, push-down ETL/ELT functionality. With a fast setup, you are up and running in minutes.", "tool_function": "Big Data as a Service"}, {"name": "PubNub", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Build real-time apps quickly and scale them globally.", "description": "PubNub makes it easy for you to add real-time capabilities to your apps, without worrying about the infrastructure. Build apps that allow your users to engage in real-time across mobile, browser, desktop and server.", "tool_function": "Realtime Backend / API"}, {"name": "DigitalOcean", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Deploy an SSD cloud server in less than 55 seconds with a dedicated IP and root access.", "description": "We take the complexities out of cloud hosting by offering blazing fast, on-demand SSD cloud servers, straightforward pricing, a simple API, and an easy-to-use control panel. ", "tool_function": "Cloud Hosting"}, {"name": "Meteor", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "An ultra-simple, database-everywhere, data-on-the-wire, pure-Javascript web framework", "description": "A Meteor application is a mix of JavaScript that runs inside a client web browser, JavaScript that runs on the Meteor server inside a Node.js container, and all the supporting HTML fragments, CSS rules, and static assets. ", "tool_function": "Frameworks (Full Stack)"}, {"name": "Serverless", "category": "Application and Data", "subcategory": "Application Hosting", "title": "The most widely-adopted toolkit for building serverless applications", "description": "Build applications comprised of microservices that run in response to events, auto-scale for you, and only charge you when they run. This lowers the total cost of maintaining your apps, enabling you to build more logic, faster. The Framework uses new event-driven compute services, like AWS Lambda, Google CloudFunctions, and more.", "tool_function": "Serverless / Task Processing"}, {"name": "Material-UI", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Material UI is a library of React UI components that implements Google's Material Design.", "description": "Material UI is a library of React UI components that implements Google's Material Design.", "tool_function": "Front-End Frameworks"}, {"name": "Google Compute Engine", "category": "Application and Data", "subcategory": "Application Hosting", "title": "Run large-scale workloads on virtual machines hosted on Google's infrastructure.", "description": "Google Compute Engine is a service that provides virtual machines that run on Google infrastructure. Google Compute Engine offers scale, performance, and value that allows you to easily launch large compute clusters on Google's infrastructure. There are no upfront investments and you can run up to thousands of virtual CPUs on a system that has been designed from the ground up to be fast, and to offer strong consistency of performance.", "tool_function": "Cloud Hosting"}, {"name": "Apache FreeMarker", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A free Java-based template engine", "description": "It is a \"template engine\"; a generic tool to generate text output (anything from HTML to auto generated source code) based on templates. It's a Java package, a class library for Java programmers. ", "tool_function": "Java Tools"}, {"name": "Amazon EBS", "category": "Application and Data", "subcategory": "Data Stores", "title": "Block level storage volumes for use with Amazon EC2 instances. ", "description": "Amazon EBS volumes are network-attached, and persist independently from the life of an instance. Amazon EBS provides highly available, highly reliable, predictable storage volumes that can be attached to a running Amazon EC2 instance and exposed as a device within the instance. Amazon EBS is particularly suited for applications that require a database, file system, or access to raw block level storage.", "tool_function": "Cloud Storage"}, {"name": "Redux", "category": "Application and Data", "subcategory": "Libraries", "title": "Predictable state container for JavaScript apps", "description": "It helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test. t provides a great experience, such as live code editing combined with a time traveling debugger.", "tool_function": "State Management Library"}, {"name": "MongoLab", "category": "Application and Data", "subcategory": "Data Stores", "title": "Database-as-a-Service for MongoDB", "description": "mLab is the largest cloud MongoDB service in the world, hosting over a half million deployments on AWS, Azure, and Google.", "tool_function": "MongoDB Hosting"}, {"name": "Ionicons", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "Beautifully crafted open source icons", "description": "Premium designed icons for use in web, iOS, Android, and desktop apps. Support for SVG and web font. Completely open source and MIT licensed.", "tool_function": "UI Components"}, {"name": "Airflow", "category": "Application and Data", "subcategory": "Data Stores", "title": "A platform to programmaticaly author, schedule and monitor data pipelines, by Airbnb", "description": "Use Airflow to author workflows as directed acyclic graphs (DAGs) of tasks. The Airflow scheduler executes your tasks on an array of workers while following the specified dependencies. Rich command lines utilities makes performing complex surgeries on DAGs a snap. The rich user interface makes it easy to visualize pipelines running in production, monitor progress and troubleshoot issues when needed.", "tool_function": "Workflow Manager"}, {"name": "React Native", "category": "Application and Data", "subcategory": "Languages & Frameworks", "title": "A framework for building native apps with React", "description": "React Native enables you to build world-class application experiences on native platforms using a consistent developer experience based on JavaScript and React. The focus of React Native is on developer efficiency across all the platforms you care about - learn once, write anywhere. Facebook uses React Native in multiple production apps and will continue investing in React Native.", "tool_function": "Cross-Platform Mobile Development"}, {"name": "Google Analytics", "category": "Utilities", "subcategory": "Analytics", "title": "Enterprise-class web analytics.", "description": "Google Analytics lets you measure your advertising ROI as well as track your Flash, video, and social networking sites and applications.", "tool_function": "General Analytics"}, {"name": "Google Tag Manager", "category": "Utilities", "subcategory": "Analytics", "title": "Quickly and easily update tags and code snippets on your website or mobile app", "description": "Tag Manager gives you the ability to add and update your own tags for conversion tracking, site analytics, remarketing, and more. There are nearly endless ways to track user behavior across your sites and apps, and the intuitive design lets you change tags whenever you want.", "tool_function": "Analytics Integrator"}, {"name": "Google Maps", "category": "Utilities", "subcategory": "Application Utilities", "title": "Build highly customisable maps with your own content and imagery", "description": "Create rich applications and stunning visualisations of your data, leveraging the comprehensiveness, accuracy, and usability of Google Maps and a modern web platform that scales as you grow.", "tool_function": "Mapping APIs"}, {"name": "OpenSSL", "category": "Utilities", "subcategory": "Application Utilities", "title": "Full-featured toolkit for the Transport Layer Security and Secure Sockets Layer protocols", "description": "It is a robust, commercial-grade, and full-featured toolkit for the Transport Layer Security (TLS) and Secure Sockets Layer (SSL) protocols. It is also a general-purpose cryptography library.", "tool_function": "Security"}, {"name": "Optimizely", "category": "Utilities", "subcategory": "Analytics", "title": "Experimentation platform for marketing, product, and engineering teams, with feature flags and personalization", "description": "Optimizely is the market leader in digital experience optimization, helping digital leaders and Fortune 100 companies alike optimize their digital products, commerce, and campaigns with a fully featured experimentation platform.", "tool_function": "A/B Testing Analytics"}, {"name": "Postman", "category": "Utilities", "subcategory": "Application Utilities", "title": "Only complete API development environment", "description": "It is the only complete API development environment, used by nearly five million developers and more than 100,000 companies worldwide. ", "tool_function": "API Tools"}, {"name": "Dyn", "category": "Utilities", "subcategory": "Application Utilities", "title": "Managed DNS, Outsourced DNS & Anycast DNS", "description": "An all-in-one Managed DNS service for your registered domain names. Dyn DNS is the perfect solution for your domain name’s DNS needs, whether it is for personal or business use. It gives you complete control over your DNS zone and its associated DNS records, complete with a simple DNS management web interface.\r\n", "tool_function": "DNS Management"}, {"name": "GitHub Pages", "category": "Utilities", "subcategory": "Application Utilities", "title": "Public webpages freely hosted and easily published.", "description": "Public webpages hosted directly from your GitHub repository. Just edit, push, and your changes are live.", "tool_function": "Static Web Hosting"}, {"name": "Twilio SendGrid", "category": "Utilities", "subcategory": "Communications", "title": "Email Delivery. Simplified.", "description": "Twilio SendGrid's cloud-based email infrastructure relieves businesses of the cost and complexity of maintaining custom email systems. Twilio SendGrid provides reliable delivery, scalability & real-time analytics along with flexible API's.", "tool_function": "Transactional Email"}, {"name": "Twilio", "category": "Utilities", "subcategory": "Communications", "title": "Bring voice and messaging to your web and mobile applications.", "description": "Twilio offers developers a powerful API for phone services to make and receive phone calls, and send and receive text messages. Their product allows programmers to more easily integrate various communication methods into their software and programs. ", "tool_function": "Voice and SMS"}, {"name": "Amazon SES", "category": "Utilities", "subcategory": "Communications", "title": "Bulk and transactional email-sending service.", "description": "Amazon SES eliminates the complexity and expense of building an in-house email solution or licensing, installing, and operating a third-party email service. The service integrates with other AWS services, making it easy to send emails from applications being hosted on services such as Amazon EC2. ", "tool_function": "Transactional Email"}, {"name": "Mailgun", "category": "Utilities", "subcategory": "Communications", "title": "The Email Service for Developers.", "description": "Mailgun is a set of powerful APIs that allow you to send, receive, track and store email effortlessly.", "tool_function": "Transactional Email"}, {"name": "Elasticsearch", "category": "Utilities", "subcategory": "Application Utilities", "title": "Open Source, Distributed, RESTful Search Engine", "description": "Elasticsearch is a distributed, RESTful search and analytics engine capable of storing data and searching it in near real time. Elasticsearch, Kibana, Beats and Logstash are the Elastic Stack (sometimes called the ELK Stack). ", "tool_function": "Search as a Service"}, {"name": "Crazy Egg", "category": "Utilities", "subcategory": "Analytics", "title": "Visualize where your visitors click", "description": "Crazy Egg gives you the competitive advantage to improve your website in a heartbeat without the high costs.", "tool_function": "Heatmap Analytics"}, {"name": "Segment", "category": "Utilities", "subcategory": "Analytics", "title": "A single hub to collect, translate and send your data with the flip of a switch.", "description": "Segment is a single hub for customer data. Collect your data in one place, then send it to more than 100 third-party tools, internal systems, or Amazon Redshift with the flip of a switch.", "tool_function": "Analytics Integrator"}, {"name": "Mixpanel", "category": "Utilities", "subcategory": "Analytics", "title": "Powerful, self-serve product analytics to help you convert, engage, and retain more users", "description": "Mixpanel helps companies build better products through data. With our powerful, self-serve product analytics solution, teams can easily analyze how and why people engage, convert, and retain to improve their user experience.", "tool_function": "Mobile Analytics"}, {"name": "Amazon Kinesis", "category": "Utilities", "subcategory": "Application Utilities", "title": "Store and process terabytes of data each hour from hundreds of thousands of sources", "description": "Amazon Kinesis can collect and process hundreds of gigabytes of data per second from hundreds of thousands of sources, allowing you to easily write applications that process information in real-time, from sources such as web site click-streams, marketing and financial information, manufacturing instrumentation and social media, and operational logs and metering data. ", "tool_function": "Real-time Data Processing"}, {"name": "jQuery Mobile", "category": "Utilities", "subcategory": "Mobile", "title": "Touch-Optimized Web Framework for Smartphones & Tablets", "description": "jQuery Mobile is a HTML5-based user interface system designed to make responsive web sites and apps that are accessible on all smartphone, tablet and desktop devices.", "tool_function": "Mobile UI Frameworks"}, {"name": "Squarespace", "category": "Utilities", "subcategory": "Application Utilities", "title": "Everything You Need To Create An Exceptional Website", "description": "Whether you need simple pages, sophisticated galleries, a professional blog, or want to sell online, it all comes standard with your Squarespace website. Squarespace starts you with beautiful designs right out of the box — each handcrafted by our award-winning design team to make your content stand out.", "tool_function": "Website Builder"}, {"name": "Piwik", "category": "Utilities", "subcategory": "Analytics", "title": "The ultimate open source alternative to Google Analytics", "description": "Matomo (formerly Piwik) is a full-featured PHP MySQL software program that you download and install on your own webserver. At the end of the five-minute installation process, you will be given a JavaScript code.", "tool_function": "General Analytics"}, {"name": "DNS Made Easy", "category": "Utilities", "subcategory": "Application Utilities", "title": "DNS performance, reliability, and security have never been easier.", "description": "DNS Made Easy is a subsidiary of Tiggee LLC, and is a world leader in providing global IP Anycast enterprise DNS services. DNS Made Easy is currently ranked the fastest provider for 8 consecutive months and the most reliable provider.", "tool_function": "DNS Management"}, {"name": "Heap", "category": "Utilities", "subcategory": "Analytics", "title": "Automatically capture every user action in your app and measure it all", "description": "Heap automatically captures every user action in your app and lets you measure it all. Clicks, taps, swipes, form submissions, page views, and more. Track events and segment users instantly. No pushing code. No waiting for data to trickle in.", "tool_function": "Funnel Analysis Analytics"}, {"name": "Mandrill", "category": "Utilities", "subcategory": "Communications", "title": "Send transactional, triggered, and personalized email, then track results.", "description": "Mandrill is a new way for apps to send transactional email. It runs on the delivery infrastructure that powers MailChimp.", "tool_function": "Transactional Email"}, {"name": "WooCommerce", "category": "Utilities", "subcategory": "Application Utilities", "title": "The most popular WordPress eCommerce plugin", "description": "WooCommerce is the most popular WordPress eCommerce plugin. And it's available for free. Packed full of features, perfectly integrated into your self-hosted WordPress website.", "tool_function": "Ecommerce"}, {"name": "Okta", "category": "Utilities", "subcategory": "Application Utilities", "title": "Enterprise-grade identity management for all your apps, users & devices", "description": "Connect all your apps in days, not months, with instant access to thousands of pre-built integrations - even add apps to the network yourself. Integrations are easy to set up, constantly monitored, proactively repaired and handle authentication and provisioning.", "tool_function": "Identity Verification as a Service"}, {"name": "Gravity Forms", "category": "Utilities", "subcategory": "Application Utilities", "title": "Create Advanced Forms for Your WordPress-Powered Website", "description": "It is a WordPress plugin used originally for contact forms, but in a more general sense, it allows site owners to create forms to collect information. It can be used for contact forms, WordPress post creation, calculators, employment applications and more.", "tool_function": "Web Forms"}, {"name": "Jekyll", "category": "Utilities", "subcategory": "Application Utilities", "title": "Blog-aware, static site generator in Ruby", "description": "Think of Jekyll as a file-based CMS, without all the complexity. Jekyll takes your content, renders Markdown and Liquid templates, and spits out a complete, static website ready to be served by Apache, Nginx or another web server. Jekyll is the engine behind GitHub Pages, which you can use to host sites right from your GitHub repositories.", "tool_function": "Static Site Generators"}, {"name": "Stripe", "category": "Utilities", "subcategory": "Payments", "title": "Payments for developers", "description": "Stripe makes it easy for developers to accept credit cards on the web.", "tool_function": "Payment Services"}, {"name": "Stack Overflow", "category": "Utilities", "subcategory": "Application Utilities", "title": "Question and answer site for professional and enthusiast programmers", "description": "Stack Overflow is a question and answer site for professional and enthusiast programmers. It's built and run by you as part of the Stack Exchange network of Q&A sites. With your help, we're working together to build a library of detailed answers to every question about programming.", "tool_function": "Question and Answer Sites"}, {"name": "OpenAPI Specification", "category": "Utilities", "subcategory": "Application Utilities", "title": "An API description format for REST APIs", "description": "It defines a standard, language-agnostic interface to RESTful APIs which allows both humans and computers to discover and understand the capabilities of the service without access to source code, documentation, or through network traffic inspection.", "tool_function": "API Tools"}, {"name": "Matomo", "category": "Utilities", "subcategory": "Analytics", "title": "A free and open source web analytics application ", "description": "It is a web analytics platform designed to give you the conclusive insights with our complete range of features. You can also evaluate the full user-experience of your visitor’s behaviour with its Conversion Optimization features, including Heatmaps, Sessions Recordings, Funnels, Goals, Form Analytics and A/B Testing.", "tool_function": "General Analytics"}, {"name": "Visual Website Optimizer", "category": "Utilities", "subcategory": "Analytics", "title": "A/B Testing with In-Built Heatmaps", "description": "Visual Website Optimizer is an easy to use A/B testing tool that allows marketing professionals to create different versions of their websites and landing pages using a point-and-click editor (no HTML knowledge needed!) and then see which version produces maximum conversion rate or sales", "tool_function": "A/B Testing Analytics"}, {"name": "Interana", "category": "Utilities", "subcategory": "Analytics", "title": "Analyze Billions of Events in Seconds", "description": "Interana is a solution for exploring, monitoring, and sharing data about your product, customers, and business. Run it on premises or in the cloud, share with tens to thousands of co-workers, and scale from millions to trillions of events.", "tool_function": "Business Intelligence"}, {"name": "Recurly", "category": "Utilities", "subcategory": "Payments", "title": "Subscription Billing. Zen Simplicity.", "description": "Recurly is the leading pay-as-you-go recurring billing service because setup is easy, integrations are quick, and our service grows with the needs of your business.", "tool_function": "Payment Services"}, {"name": "Apache Solr", "category": "Utilities", "subcategory": "Application Utilities", "title": "An open source search platform", "description": "It uses the tools you use to make application building a snap. It is built on the battle-tested Apache Zookeeper, it makes it easy to scale up and down.", "tool_function": "Search Engines"}, {"name": "Cartography", "category": "Utilities", "subcategory": "Application Utilities", "title": "A tool that consolidates infrastructure assets and the relationships between them (by Lyft)", "description": "Aims to enable a broad set of exploration and automation scenarios. It is particularly good at exposing otherwise hidden dependency relationships between your service's assets so that you may validate assumptions about security risks.", "tool_function": "Security"}, {"name": "Keycloak", "category": "Utilities", "subcategory": "Application Utilities", "title": "An open source identity and access management solution", "description": "It is an Open Source Identity and Access Management For Modern Applications and Services. It adds authentication to applications and secure services with minimum fuss. No need to deal with storing users or authenticating users. It's all available out of the box.\r\n\r\n\r\n", "tool_function": "User Management and Authentication"}, {"name": "Webflow", "category": "Utilities", "subcategory": "Application Utilities", "title": "Build responsive websites visually", "description": "Webflow is a responsive design tool that lets you design, build, and publish websites in an intuitive interface. Clean code included!", "tool_function": "Static Web Hosting"}, {"name": "Jupyter", "category": "Utilities", "subcategory": "Application Utilities", "title": "Multi-language interactive computing environments.", "description": "The Jupyter Notebook is a web-based interactive computing platform. The notebook combines live code, equations, narrative text, visualizations, interactive dashboards and other media.", "tool_function": "Data Science Notebooks"}, {"name": "Auth0", "category": "Utilities", "subcategory": "Application Utilities", "title": "Token-based Single Sign On for your Apps and APIs with social, databases and enterprise identities", "description": "A set of unified APIs and tools that instantly enables Single Sign On and user management to all your applications.", "tool_function": "User Management and Authentication"}, {"name": "BigCommerce", "category": "Utilities", "subcategory": "Application Utilities", "title": "Ecommerce platform which allows you to create an online store", "description": "It is a true all-in-one ecommerce platform with the power to grow your business & help you sell more. It empowers you to rise above complexity – and ultimately focus on optimizing your business for growth.", "tool_function": "Ecommerce"}, {"name": "OpenAPI", "category": "Utilities", "subcategory": "Application Utilities", "title": "Allows the owner of a network-accessible service to give universal access", "description": "It is a publicly available application programming interface that provides developers with programmatic access to a proprietary software application or web service.", "tool_function": "API Tools"}, {"name": "Netlify", "category": "Utilities", "subcategory": "Application Utilities", "title": "Build, deploy and host your static site or app with a drag and drop interface and automatic delpoys from GitHub or Bitbucket", "description": "Netlify is smart enough to process your site and make sure all assets gets optimized and served with perfect caching-headers from a cookie-less domain. We make sure your HTML is served straight from our CDN edge nodes without any round-trip to our backend servers and are the only ones to give you instant cache invalidation when you push a new deploy. Netlify is also the only static hosting service with integrated continuous deployment.", "tool_function": "Static Web Hosting"}, {"name": "Microsoft SSRS", "category": "Utilities", "subcategory": "Analytics", "title": "A server-based report generating software system ", "description": "It provides a set of on-premises tools and services that create, deploy, and manage mobile and paginated reports. It delivers the right information to the right users.", "tool_function": "Business Intelligence"}, {"name": "Chartbeat", "category": "Utilities", "subcategory": "Analytics", "title": "Real-time site data for front-line action takers. ", "description": "Chartbeat provides realtime analytics to Websites and blogs, and shows visitors, load times, and referring sites on a minute-by-minute basis. ", "tool_function": "Realtime Analytics"}, {"name": "Runscope", "category": "Utilities", "subcategory": "Application Utilities", "title": "API Performance Monitoring", "description": "Keep tabs on all aspects of your API's performance with uptime monitoring, integration testing, logging and real-time monitoring.", "tool_function": "API Tools"}, {"name": "Namecheap", "category": "Utilities", "subcategory": "Application Utilities", "title": "Cheap Domain Names Registration", "description": "We provide a set of DNS servers spread across the US and Europe to deliver highly reliable DNS services to everyone. By choosing Namecheap.com as your domain registrar, you are choosing a highly reputable and reliable partner. Namecheap.com is rated 4.6 out of 5 - Based on 1,395 reviews via Google Checkout", "tool_function": "Domain Registration"}, {"name": "Google Datastudio", "category": "Utilities", "subcategory": "Analytics", "title": "A reporting and data visualization tool", "description": "It lets you create reports and data visualizations. Data Sources are reusable components that connect a report to your data, such as Google Analytics, Google Sheets, Google AdWords and so forth. You can unlock the power of your data with interactive dashboards and engaging reports that inspire smarter business decisions.", "tool_function": "Business Intelligence"}, {"name": "Hotjar", "category": "Utilities", "subcategory": "Analytics", "title": "See how visitors are really using your website, collect user feedback and turn more visitors into customers.", "description": "See how visitors are really using your website, collect user feedback and turn more visitors into customers.", "tool_function": "Heatmap Analytics"}, {"name": "Amplitude", "category": "Utilities", "subcategory": "Analytics", "title": "User analytics to fuel explosive user growth", "description": "Amplitude provides scalable mobile analytics that helps companies leverage data to create explosive user growth. Anyone in the company can use Amplitude to pinpoint the most valuable behavioral patterns within hours. ", "tool_function": "Mobile Analytics"}, {"name": "Shopify", "category": "Utilities", "subcategory": "Application Utilities", "title": "Quickly and easily create a beautiful online store with Shopify.", "description": "Shopify powers tens of thousands of online retailers including General Electric, Amnesty International, CrossFit, Tesla Motors, Encyclopaedia Britannica, Foo Fighters, GitHub, and more. Our platform allows users to easily and quickly create their own online store without all the technical work involved in developing their own website, or the huge expense of having someone else build it. Shopify lets merchants manage all aspects of their shops: uploading products, changing the design, accepting credit card orders, and viewing their incoming orders and completed transactions.", "tool_function": "Ecommerce"}, {"name": "Amazon Route 53", "category": "Utilities", "subcategory": "Application Utilities", "title": "A highly available and scalable Domain Name System (DNS) web service.", "description": "Amazon Route 53 is designed to give developers and businesses an extremely reliable and cost effective way to route end users to Internet applications by translating human readable names like www.example.com into the numeric IP addresses like 192.0.2.1 that computers use to connect to each other. Route 53 effectively connects user requests to infrastructure running in Amazon Web Services (AWS) – such as an Amazon Elastic Compute Cloud (Amazon EC2) instance, an Amazon Elastic Load Balancer, or an Amazon Simple Storage Service (Amazon S3) bucket – and can also be used to route users to infrastructure outside of AWS.", "tool_function": "DNS Management"}, {"name": "PayPal", "category": "Utilities", "subcategory": "Payments", "title": "Send Money, Pay Online or Set Up a Merchant Account", "description": "PayPal is an online payments and money transfer service that allows you to send money via email, phone, text message or Skype. They offer products to both individuals and businesses alike, including online vendors, auction sites and corporate users. PayPal connects effortlessly to bank accounts and credit cards.\nPayPal Mobile is one of PayPal’s newest products. It allows you to send payments by text message or by using PayPal’s mobile browser.", "tool_function": "Payment Services"}, {"name": "FullContact", "category": "Utilities", "subcategory": "Application Utilities", "title": "Powerful APIs to help you turn partial contact information into full contact data.", "description": "FullContact offers developers powerful contact management APIs to you turn partial contact information into full contact data. Query by email, phone, or company domain and receive rich company data in response.", "tool_function": "Customer Information API"}, {"name": "Looker", "category": "Utilities", "subcategory": "Analytics", "title": "Pioneering the next generation of BI, data discovery & data analytics", "description": "We've built a unique data modeling language, connections to today's fastest analytical databases, and a service that you can deploy on any infrastructure, and explore on any device. Plus, we'll help you every step of the way.", "tool_function": "Business Intelligence"}, {"name": "Paw", "category": "Utilities", "subcategory": "Application Utilities", "title": "The ultimate REST client for Mac", "description": "Paw is a full-featured and beautifully designed Mac app that makes interaction with REST services delightful. Either you are an API maker or consumer, Paw helps you build HTTP requests, inspect the server's response and even generate client code.", "tool_function": "API Tools"}, {"name": "CyberSource", "category": "Utilities", "subcategory": "Payments", "title": "Simplifying Payment Management:  eCommerce & Multi-Channel", "description": "It is an e-commerce credit card payment system management company. Customers process online payments, streamline online fraud management, and simplify payment security. ", "tool_function": "Payment Services"}, {"name": "Cyfe", "category": "Utilities", "subcategory": "Analytics", "title": "All-In-One Dashboard", "description": "Cyfe is an all-in-one dashboard that helps you monitor and analyze data found across all your online services like Google Analytics, Salesforce, AdSense, MailChimp, Amazon, Facebook, WordPress, Zendesk, Twitter and more from one single location in real-time.", "tool_function": "Business Dashboards"}, {"name": "Disqus", "category": "Utilities", "subcategory": "Application Utilities", "title": "Elevating the discussion, anywhere on the web.", "description": "Disqus looks to make it very easy and rewarding for people to interact on websites using its system. Commenters can build reputation and carry their contributions from one website to the next. ", "tool_function": "Commenting Service"}, {"name": "Amazon SNS", "category": "Utilities", "subcategory": "Communications", "title": "Fully managed push messaging service", "description": "Amazon Simple Notification Service makes it simple and cost-effective to push to mobile devices such as iPhone, iPad, Android, Kindle Fire, and internet connected smart devices, as well as pushing to other distributed services. Besides pushing cloud notifications directly to mobile devices, SNS can also deliver notifications by SMS text message or email, to Simple Queue Service (SQS) queues, or to any HTTP endpoint.", "tool_function": "Mobile Push Messaging"}, {"name": "Zuora", "category": "Utilities", "subcategory": "Payments", "title": "Billing, Commerce & Finance to Power your Subscription Business", "description": "Zuora gives you the enterprise-class, cloud-based tools you need to launch and scale any subscription service, quickly and affordably. Design your pricing and packaging, start taking quotes and placing orders, automate your billing and payments, and keep tabs on your financials.", "tool_function": "Payment Services"}, {"name": "Metabase", "category": "Utilities", "subcategory": "Analytics", "title": "An open-source business intelligence tool", "description": "It is an easy way to generate charts and dashboards, ask simple ad hoc queries without using SQL, and see detailed information about rows in your Database. You can set it up in under 5 minutes, and then give yourself and others a place to ask simple questions and understand the data your application is generating.", "tool_function": "Business Intelligence"}, {"name": "Postmark", "category": "Utilities", "subcategory": "Communications", "title": "Email delivery for web apps - done right.", "description": "Postmark removes the headaches of delivering and parsing email for webapps with minimal setup time and zero maintenance.", "tool_function": "Transactional Email"}, {"name": "Amazon API Gateway", "category": "Utilities", "subcategory": "Application Utilities", "title": "Create, publish, maintain, monitor, and secure APIs at any scale", "description": "Amazon API Gateway handles all the tasks involved in accepting and processing up to hundreds of thousands of concurrent API calls, including traffic management, authorization and access control, monitoring, and API version management.", "tool_function": "API Tools"}, {"name": "Rake", "category": "Utilities", "subcategory": "Application Utilities", "title": "A software task management and build automation tool", "description": "It is a software task management and build automation tool. It allows the user to specify tasks and describe dependencies as well as to group tasks in a namespace.", "tool_function": "Task Management"}, {"name": "Gatling", "category": "Utilities", "subcategory": "Application Utilities", "title": "Open-source load testing for DevOps and CI/CD", "description": "Gatling is a highly capable load testing tool. It is designed for ease of use, maintainability and high performance.\r\n\r\nOut of the box, Gatling comes with excellent support of the HTTP protocol that makes it a tool of choice for load testing any HTTP server. As the core engine is actually protocol agnostic, it is perfectly possible to implement support for other protocols. For example, Gatling currently also ships JMS support.", "tool_function": "Load and Performance Testing"}, {"name": "Hugo", "category": "Utilities", "subcategory": "Application Utilities", "title": "A Fast and Flexible Static Site Generator written in Go", "description": "Hugo is a static site generator written in Go. It is optimized for speed, easy use and configurability. Hugo takes a directory with content and templates and renders them into a full html website. Hugo makes use of markdown files with front matter for meta data.", "tool_function": "Static Site Generators"}, {"name": "Sqreen", "category": "Utilities", "subcategory": "Application Utilities", "title": "Automated security for developers", "description": "Sqreen is a security platform that helps engineering team protect their web applications, API and micro-services in real-time. The solution installs with a simple application library and doesn't require engineering resources to operate. Security anomalies triggered are reported with technical context to help engineers fix the code. Ops team can assess the impact of attacks and monitor suspicious user accounts involved.\r\n", "tool_function": "Security"}, {"name": "TransmogrifAI", "category": "Utilities", "subcategory": "Application Utilities", "title": "Automated machine learning for structured data (by Salesforce)", "description": "TransmogrifAI (pronounced trăns-mŏgˈrə-fī) is an AutoML library for building modular, reusable, strongly typed machine learning workflows on Spark with minimal hand tuning", "tool_function": "Machine Learning Tools"}, {"name": "Chargify", "category": "Utilities", "subcategory": "Payments", "title": "Easily Manage Your Recurring Revenue Business", "description": "Chargify simplifies recurring billing for Web 2.0 and SaaS companies. Build innovative web applications without worrying how to bill your customers. ", "tool_function": "Payment Services"}, {"name": "New Relic", "category": "DevOps", "subcategory": "Monitoring", "title": "New Relic is the industry’s largest and most comprehensive cloud-based observability platform.", "description": "The world’s best software and DevOps teams rely on New Relic to move faster, make better decisions and create best-in-class digital experiences. If you run software, you need to run New Relic. More than 50% of the Fortune 100 do too.", "tool_function": "Performance Monitoring"}, {"name": "GitHub", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Powerful collaboration, review, and code management for open source and private development projects", "description": "GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over three million people use GitHub to build amazing things together.", "tool_function": "Code Collaboration & Version Control"}, {"name": "Docker", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Enterprise Container Platform for High-Velocity Innovation.", "description": "The Docker Platform is the industry-leading container platform for continuous, high-velocity innovation, enabling organizations to seamlessly build and share any application — from legacy to what comes next  — and securely run them anywhere", "tool_function": "Virtual Machine Platforms & Containers"}, {"name": "Varnish", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "High-performance HTTP accelerator", "description": "Varnish Cache is a web application accelerator also known as a caching HTTP reverse proxy. You install it in front of any server that speaks HTTP and configure it to cache the contents. Varnish Cache is really, really fast. It typically speeds up delivery with a factor of 300 - 1000x, depending on your architecture.", "tool_function": "Web Cache"}, {"name": "Jenkins", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "An extendable open source continuous integration server", "description": "In a nutshell Jenkins CI is the leading open-source continuous integration server. Built with Java, it provides over 300 plugins to support building and testing virtually any project.", "tool_function": "Continuous Integration"}, {"name": "RequireJS", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "JavaScript file and module loader", "description": "RequireJS loads plain JavaScript files as well as more defined modules. It is optimized for in-browser use, including in a Web Worker, but it can be used in other JavaScript environments, like Rhino and Node. It implements the Asynchronous Module API. Using a modular script loader like RequireJS will improve the speed and quality of your code.", "tool_function": "Front End Package Manager"}, {"name": "TrackJS", "category": "DevOps", "subcategory": "Monitoring", "title": "JavaScript Error Monitoring for Modern Web Applications", "description": "Production error monitoring and reporting for web applications. TrackJS provides deep insights into real user errors. See the user, network, and application events that tell the story of an error so you can actually fix them.", "tool_function": "Exception Monitoring"}, {"name": "Git", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Fast, scalable, distributed revision control system", "description": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency.", "tool_function": "Version Control System"}, {"name": "Visual Studio Code", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Build and debug modern web and cloud applications, by Microsoft", "description": "Build and debug modern web and cloud applications. Code is free and available on your favorite platform - Linux, Mac OSX, and Windows.", "tool_function": "Text Editor"}, {"name": "npm", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The package manager for JavaScript.", "description": "npm is the command-line interface to the npm ecosystem. It is battle-tested, surprisingly flexible, and used by hundreds of thousands of JavaScript developers every day.", "tool_function": "Front End Package Manager"}, {"name": "Terraform", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Describe your complete infrastructure as code and build resources across providers", "description": "With Terraform, you describe your complete infrastructure as code, even as it spans multiple service providers. Your servers may come from AWS, your DNS may come from CloudFlare, and your database may come from Heroku. Terraform will build all these resources across all these providers in parallel.", "tool_function": "Server Configuration and Automation"}, {"name": "Kubernetes", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Manage a cluster of Linux containers as a single system to accelerate Dev and simplify Ops", "description": "Kubernetes is an open source orchestration system for Docker containers. It handles scheduling onto nodes in a compute cluster and actively manages workloads to ensure that their state matches the users declared intentions.", "tool_function": "Container Tools"}, {"name": "Bitbucket", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "One place to plan projects, collaborate on code, test and deploy, all with free private repositories", "description": "Bitbucket gives teams one place to plan projects, collaborate on code, test and deploy, all with free private Git repositories. Teams choose Bitbucket because it has a superior Jira integration, built-in CI/CD, & is free for up to 5 users.", "tool_function": "Code Collaboration & Version Control"}, {"name": "IntelliJ IDEA", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Capable and Ergonomic IDE for JVM", "description": "Out of the box, IntelliJ IDEA provides a comprehensive feature set including tools and integrations with the most important modern technologies and frameworks for enterprise and web development with Java, Scala, Groovy and other languages.", "tool_function": "Integrated Development Environment"}, {"name": "Visual Studio", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "State-of-the-art tools and services that you can use to create great apps for devices, the cloud, and everything in between.", "description": "Visual Studio is a suite of component-based software development tools and other technologies for building powerful, high-performance applications.", "tool_function": "Integrated Development Environment"}, {"name": "Sentry", "category": "DevOps", "subcategory": "Monitoring", "title": "See performance issues, fix errors faster, and optimize code health. ", "description": "Sentry’s Application Monitoring platform helps developers see performance issues, fix errors faster, and optimize their code health. ", "tool_function": "Exception Monitoring"}, {"name": "Xcode", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The complete toolset for building great apps", "description": "The Xcode IDE is at the center of the Apple development experience. Tightly integrated with the Cocoa and Cocoa Touch frameworks, Xcode is an incredibly productive environment for building amazing apps for Mac, iPhone, and iPad.", "tool_function": "Integrated Development Environment"}, {"name": "Eclipse", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "IDE for Java EE Developers", "description": "Standard Eclipse package suited for Java and plug-in development plus adding new plugins; already includes Git, Marketplace Client, source code and developer documentation. \r\nClick here to file a bug against Eclipse Platform.", "tool_function": "Integrated Development Environment"}, {"name": "CircleCI", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Automate your development process quickly, safely, and at scale", "description": "Continuous integration and delivery platform helps software teams rapidly release code with confidence by automating the build, test, and deploy process. Offers a modern software development platform that lets teams ramp.", "tool_function": "Continuous Integration"}, {"name": "VirtualBox", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Run nearly any operating system on a single machine and to freely switch between OS instances running simultaneously", "description": "VirtualBox is a powerful x86 and AMD64/Intel64 virtualization product for enterprise as well as home use. Not only is VirtualBox an extremely feature rich, high performance product for enterprise customers, it is also the only professional solution that is freely available as Open Source Software under the terms of the GNU General Public License (GPL) version 2.", "tool_function": "Virtualization Platform"}, {"name": "Apache Maven", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Apache build manager for Java projects. ", "description": "Maven allows a project to build using its project object model (POM) and a set of plugins that are shared by all projects using Maven, providing a uniform build system. Once you familiarize yourself with how one Maven project builds you automatically know how all Maven projects build saving you immense amounts of time when trying to navigate many projects.", "tool_function": "Java Build Tools"}, {"name": "PagerDuty", "category": "DevOps", "subcategory": "Monitoring", "title": "Incident management with powerful visibility, reliable alerting, and improved collaboration", "description": "PagerDuty is an alarm aggregation and dispatching service for system administrators and support teams. It collects alerts from your monitoring tools, gives you an overall view of all of your monitoring alarms, and alerts an on duty engineer if there's a problem.\r\n", "tool_function": "Monitoring Aggregation"}, {"name": "Atom", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A hackable text editor for the 21st Century", "description": "At GitHub, we're building the text editor we've always wanted. A tool you can customize to do anything, but also use productively on the first day without ever touching a config file. Atom is modern, approachable, and hackable to the core. We can't wait to see what you build with it.", "tool_function": "Text Editor"}, {"name": "Webpack", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A bundler for javascript and friends", "description": "A bundler for javascript and friends. Packs many modules into a few bundled assets. Code Splitting allows to load parts for the application on demand. Through \"loaders\" modules can be CommonJs, AMD, ES6 modules, CSS, Images, JSON, Coffeescript, LESS, ... and your custom stuff.", "tool_function": "JS Build Tools / JS Task Runners"}, {"name": "Android Studio", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Android development environment based on IntelliJ IDEA", "description": "Android Studio is a new Android development environment based on IntelliJ IDEA. It provides new features and improvements over Eclipse ADT and will be the official Android IDE once it's ready.", "tool_function": "Integrated Development Environment"}, {"name": "Kibana", "category": "DevOps", "subcategory": "Monitoring", "title": "Visualize your Elasticsearch data and navigate the Elastic Stack", "description": "Kibana is an open source (Apache Licensed), browser based analytics and search dashboard for Elasticsearch. Kibana is a snap to setup and start using. Kibana strives to be easy to get started with, while also being flexible and powerful, just like Elasticsearch.", "tool_function": "Monitoring Tools"}, {"name": "Amazon EC2 Container Service", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Container management service that supports Docker containers", "description": "Amazon EC2 Container Service lets you launch and stop container-enabled applications with simple API calls, allows you to query the state of your cluster from a centralized service, and gives you access to many familiar Amazon EC2 features like security groups, EBS volumes and IAM roles.", "tool_function": "Containers as a Service"}, {"name": "Gradle", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A powerful build system for the JVM", "description": "Gradle is a build tool with a focus on build automation and support for multi-language development. If you are building, testing, publishing, and deploying software on any platform, Gradle offers a flexible model that can support the entire development lifecycle from compiling and packaging code to publishing web sites.", "tool_function": "Java Build Tools"}, {"name": "Sublime Text", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A sophisticated text editor for code, markup and prose.", "description": "Sublime Text is available for OS X, Windows and Linux. One license is all you need to use Sublime Text on every computer you own, no matter what operating system it uses.\r\n\r\nSublime Text uses a custom UI toolkit, optimized for speed and beauty, while taking advantage of native functionality on each platform.", "tool_function": "Text Editor"}, {"name": "ESLint", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The fully pluggable JavaScript code quality tool", "description": "A pluggable and configurable linter tool for identifying and reporting on patterns in JavaScript. Maintain your code quality with ease.", "tool_function": "Code Review"}, {"name": "Selenium", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Web Browser Automation", "description": "Selenium automates browsers. That's it! What you do with that power is entirely up to you. Primarily, it is for automating web applications for testing purposes, but is certainly not limited to just that. Boring web-based administration tasks can (and should!) also be automated as well.", "tool_function": "Browser Testing"}, {"name": "Sumo Logic", "category": "DevOps", "subcategory": "Monitoring", "title": "Cloud Log Management for Application Logs and IT Log Data", "description": "Cloud-based machine data analytics platform that enables companies to proactively identify availability and performance issues in their infrastructure, improve their security posture and enhance application rollouts. Companies using Sumo Logic reduce their mean-time-to-resolution by 50% and can save hundreds of thousands of dollars, annually.  Customers include Netflix, Medallia, Orange, and GoGo Inflight.  ", "tool_function": "Log Management"}, {"name": "Datadog", "category": "DevOps", "subcategory": "Monitoring", "title": "Unify logs, metrics, and traces from across your distributed infrastructure.", "description": "Datadog is the leading service for cloud-scale monitoring. It is used by IT, operations, and development teams who build and operate applications that run on dynamic or hybrid cloud infrastructure. Start monitoring in minutes with Datadog!", "tool_function": "Performance Monitoring"}, {"name": "Docker Compose", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Define and run multi-container applications with Docker", "description": "With Compose, you define a multi-container application in a single file, then spin your application up in a single command which does everything that needs to be done to get it running.", "tool_function": "Container Tools"}, {"name": "Apache Traffic Server", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "RFC compliant, high performance HTTP proxy cache", "description": "It is a fast, scalable and extensible HTTP/1.1 and HTTP/2.0 compliant caching proxy server.Improve your response time, while reducing server load and bandwidth needs by caching and reusing frequently-requested web pages, images, and web ser", "tool_function": "Web Cache"}, {"name": "AWS Elastic Load Balancing", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Automatically distribute your incoming application traffic across multiple Amazon EC2 instances", "description": "With Elastic Load Balancing, you can add and remove EC2 instances as your needs change without disrupting the overall flow of information. If one EC2 instance fails, Elastic Load Balancing automatically reroutes the traffic to the remaining running EC2 instances. If the failed EC2 instance is restored, Elastic Load Balancing restores the traffic to that instance. Elastic Load Balancing offers clients a single point of contact, and it can also serve as the first line of defense against attacks on your network. You can offload the work of encryption and decryption to Elastic Load Balancing, so your servers can focus on their main task.", "tool_function": "Load Balancer / Reverse Proxy"}, {"name": "Salt", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Fast, scalable and flexible software for data center automation", "description": "Salt is a new approach to infrastructure management. Easy enough to get running in minutes, scalable enough to manage tens of thousands of servers, and fast enough to communicate with them in seconds.\r\n\r\nSalt delivers a dynamic communication bus for infrastructures that can be used for orchestration, remote execution, configuration management and much more.", "tool_function": "Server Configuration and Automation"}, {"name": "JUnit", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A programmer-oriented testing framework for Java", "description": "JUnit is a simple framework to write repeatable tests. It is an instance of the xUnit architecture for unit testing frameworks.\r\n", "tool_function": "Testing Frameworks"}, {"name": "Rollbar", "category": "DevOps", "subcategory": "Monitoring", "title": "Proactively discover, predict, and remediate errors.", "description": "Rollbar is the leading continuous code improvement platform that proactively discovers, predicts, and remediates errors with real-time AI-assisted workflows. With Rollbar, developers continually improve their code and constantly innovate ra", "tool_function": "Exception Monitoring"}, {"name": "Vagrant", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A tool for building and distributing development environments", "description": "Vagrant provides the framework and configuration format to create and manage complete portable development environments. These development environments can live on your computer or in the cloud, and are portable between Windows, Mac OS X, and Linux.", "tool_function": "Virtual Machine Management"}, {"name": "Bugsnag", "category": "DevOps", "subcategory": "Monitoring", "title": "Bugsnag provides production error monitoring and management for front-end, mobile and back-end applications", "description": "Bugsnag captures errors from your web, mobile and back-end applications, providing instant visibility into user impact.  Diagnostic data and tools are included to help your team prioritize, debug and fix exceptions fast.", "tool_function": "Exception Monitoring"}, {"name": "WebStorm", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The smartest JavaScript IDE", "description": "WebStorm is a lightweight and intelligent IDE for front-end development and server-side JavaScript.", "tool_function": "Integrated Development Environment"}, {"name": "Yarn", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A new package manager for JavaScript", "description": "Yarn caches every package it downloads so it never needs to again. It also parallelizes operations to maximize resource utilization so install times are faster than ever.", "tool_function": "Front End Package Manager"}, {"name": "Parcel", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "📦🚀  A fast, zero configuration web application bundler", "description": "Parcel is a web application bundler, differentiated by its developer experience. It offers blazing fast performance utilizing multicore processing, and requires zero configuration.", "tool_function": "JS Build Tools / JS Task Runners"}, {"name": "CMake", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "An open-source system that manages the build process ", "description": "It is used to control the software compilation process using simple platform and compiler independent configuration files, and generate native makefiles and workspaces that can be used in the compiler environment of the user's choice.", "tool_function": "Java Build Tools"}, {"name": "SourceTree", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A free Git GUI client for Windows and macOS", "description": "Use the full capability of Git and Mercurial in the SourceTree desktop app. Manage all your repositories, hosted or local, through SourceTree's simple interface.", "tool_function": "Source Code Management Desktop Apps"}, {"name": "Chef", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Build, destroy and rebuild servers on any public or private cloud", "description": "Chef enables you to manage and scale cloud infrastructure with no downtime or interruptions. Freely move applications and configurations from one cloud to another. Chef is integrated with all major cloud providers including Amazon EC2, VMWare, IBM Smartcloud, Rackspace, OpenStack, Windows Azure, HP Cloud, Google Compute Engine, Joyent Cloud and others.", "tool_function": "Server Configuration and Automation"}, {"name": "Sauce Labs", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Test mobile or web apps instantly across 700+ browser/OS/device platform combinations - without infrastructure setup.", "description": "Cloud-based automated testing platform enables developers and QEs to perform functional, JavaScript unit, and manual tests with Selenium or Appium on web and mobile apps. Videos and screenshots for easy debugging. Secure and CI-ready.", "tool_function": "Browser Testing"}, {"name": "Travis CI", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A hosted continuous integration service for open source and private projects", "description": "Free for open source projects, our CI environment provides multiple runtimes (e.g. Node.js or PHP versions), data stores and so on. Because of this, hosting your project on travis-ci.com means you can effortlessly test your library or applications against multiple runtimes and data stores without even having all of them installed locally.", "tool_function": "Continuous Integration"}, {"name": "CodeMirror", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A versatile text editor implemented in JavaScript for the browser", "description": "CodeMirror is a JavaScript component that provides a code editor in the browser. When a mode is available for the language you are coding in, it will color your code, and optionally help with indentation.", "tool_function": "Text Editor"}, {"name": "Apache Mesos", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Develop and run resource-efficient distributed systems", "description": "Apache Mesos is a cluster manager that simplifies the complexity of running applications on a shared pool of servers.", "tool_function": "Cluster Management"}, {"name": "OpenStack", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Open source software for building private and public clouds", "description": "OpenStack is a cloud operating system that controls large pools of compute, storage, and networking resources throughout a datacenter, all managed through a dashboard that gives administrators control while empowering their users to provision resources through a web interface.", "tool_function": "Open Source Cloud"}, {"name": "GitLab", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Open source self-hosted Git management software", "description": "GitLab offers git repository management, code reviews, issue tracking, activity feeds and wikis. Enterprises install GitLab on-premise and connect it with LDAP and Active Directory servers for secure authentication and authorization. A single GitLab server can handle more than 25,000 users but it is also possible to create a high availability setup with multiple active servers.", "tool_function": "Code Collaboration & Version Control"}, {"name": "Ansible", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Radically simple configuration-management, application deployment, task-execution, and multi-node orchestration engine", "description": "Ansible is an IT automation tool. It can configure systems, deploy software, and orchestrate more advanced IT tasks such as continuous deployments or zero downtime rolling updates. Ansible’s goals are foremost those of simplicity and maximum ease of use.", "tool_function": "Server Configuration and Automation"}, {"name": "Code Climate", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Automated Ruby Code Review", "description": "After each Git push, Code Climate analyzes your code for complexity, duplication, and common smells to determine changes in quality and surface technical debt hotspots.", "tool_function": "Code Review"}, {"name": "PyCharm", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The Most Intelligent Python IDE", "description": "PyCharm’s smart code editor provides first-class support for Python, JavaScript, CoffeeScript, TypeScript, CSS, popular template languages and more. Take advantage of language-aware code completion, error detection, and on-the-fly code fixes!", "tool_function": "Integrated Development Environment"}, {"name": "Google Kubernetes Engine", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Deploy, manage, and scale containerized applications on Kubernetes, powered by Google Cloud", "description": "Container Engine takes care of provisioning and maintaining the underlying virtual machine cluster, scaling your application, and operational logistics like logging, monitoring, and health management.", "tool_function": "Containers as a Service"}, {"name": "Consul", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A tool for service discovery, monitoring and configuration", "description": "Consul is a tool for service discovery and configuration. Consul is distributed, highly available, and extremely scalable.", "tool_function": "Open Source Service Discovery"}, {"name": "Puppet Labs", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Server automation framework and application", "description": "Puppet is an automated administrative engine for your Linux, Unix, and Windows systems and performs administrative tasks (such as adding users, installing packages, and updating server configurations) based on a centralized specification.", "tool_function": "Server Configuration and Automation"}, {"name": "Cloud9 IDE", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Your development environment, in the cloud", "description": "Cloud9 provides a development environment in the cloud. Cloud9 enables developers to get started with coding immediately with pre-setup environments called workspaces, collaborate with their peers with collaborative coding features, and build web apps with features like live preview and browser compatibility testing. It supports more than 40 languages, with class A support for PHP, Ruby, Python, JavaScript/Node.js, and Go.", "tool_function": "Cloud IDE"}, {"name": "Wavefront", "category": "DevOps", "subcategory": "Monitoring", "title": "Unified Cloud Monitoring with Real-Time Analytics", "description": "Enterprise-grade cloud monitoring and analytics at over 1 million data points per second. Reduce downtime. Boost performance. Be at the Wavefront.", "tool_function": "Performance Monitoring"}, {"name": "Stackdriver", "category": "DevOps", "subcategory": "Monitoring", "title": "Monitoring, logging, and diagnostics for applications on Google Cloud Platform and AWS", "description": "Google Stackdriver provides powerful monitoring, logging, and diagnostics. It equips you with insight into the health, performance, and availability of cloud-powered applications, enabling you to find and fix issues faster. ", "tool_function": "Cloud Monitoring"}, {"name": "NodePing", "category": "DevOps", "subcategory": "Monitoring", "title": "Uptime Monitoring for Websites and Services", "description": "It provides website and server availability monitoring. At its most basic, the service lets users enter a list of addresses of web site addresses or other Internet based services, and then checks to see if that site or service is responding properly", "tool_function": "Website Monitoring"}, {"name": "Grunt", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The JavaScript Task Runner", "description": "The less work you have to do when performing repetitive tasks like minification, compilation, unit testing, linting, etc, the easier your job becomes. After you've configured it, a task runner can do most of that mundane work for you—and your team—with basically zero effort.", "tool_function": "JS Build Tools / JS Task Runners"}, {"name": "Docker Swarm", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Native clustering for Docker. Turn a pool of Docker hosts into a single, virtual host.", "description": "Swarm serves the standard Docker API, so any tool which already communicates with a Docker daemon can use Swarm to transparently scale to multiple hosts: Dokku, Compose, Krane, Deis, DockerUI, Shipyard, Drone, Jenkins... and, of course, the Docker client itself.", "tool_function": "Container Tools"}, {"name": "Zookeeper", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Because coordinating distributed systems is a Zoo", "description": "A centralized service for maintaining configuration information, naming, providing distributed synchronization, and providing group services. All of these kinds of services are used in some form or another by distributed applications.", "tool_function": "Open Source Service Discovery"}, {"name": "BrowserStack", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "BrowserStack is a software testing platform for developers to comprehensively test websites and mobile applications", "description": "BrowserStack is a leading software testing platform for developers to comprehensively test their websites and mobile applications across 2,000+ real browsers and devices in a single cloud platform—and at scale.", "tool_function": "Browser Testing"}, {"name": "JFrog Artifactory", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Enterprise Universal Repository Manager", "description": "It integrates with your existing ecosystem supporting end-to-end binary management that overcomes the complexity of working with different software package management systems, and provides consistency to your CI/CD workflow.", "tool_function": "Java Build Tools"}, {"name": "Ghost Inspector", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Catch website bugs and regressions before they cost you", "description": "It lets you create and manage UI tests that check specific functionality in your website or application. We execute these automated browser tests continuously from the cloud and alert you if anything breaks.", "tool_function": "In-Browser Testing"}, {"name": "gulp", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The streaming build system", "description": "Build system automating tasks: minification and copying of all JavaScript files, static images. More capable of watching files to automatically rerun the task when a file changes.", "tool_function": "JS Build Tools / JS Task Runners"}, {"name": "Greenhouse", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Simple and secure continuous integration for mobile apps", "description": "Greenhouse automatically builds your project for every commit you make and runs all your unit or UI tests on the emulator/simulator or on real hardware. Automatic build distribution is also supported so that your team and clients are always up to date with the latest state of your apps.", "tool_function": "Mobile Continuous Integration"}, {"name": "Cucumber", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Simple, human collaboration.", "description": "Cucumber is a tool that supports Behaviour-Driven Development (BDD) - a software development process that aims to enhance software quality and reduce maintenance costs.", "tool_function": "Testing Frameworks"}, {"name": "RSpec", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Behaviour Driven Development for Ruby", "description": "Behaviour Driven\nDevelopment for Ruby.\nMaking TDD Productive and Fun.", "tool_function": "Testing Frameworks"}, {"name": "JaCoCo", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A code coverage library for Java", "description": "It is a free code coverage library for Java, which has been created based on the lessons learned from using and integration existing libraries for many years.", "tool_function": "Code Review"}, {"name": "Azure Kubernetes Service", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Simplify Kubernetes management, deployment, and operations.", "description": "Deploy and manage containerized applications more easily with a fully managed Kubernetes service. It offers serverless Kubernetes, an integrated continuous integration and continuous delivery (CI/CD) experience, and enterprise-grade security and governance. Unite your development and operations teams on a single platform to rapidly build, deliver, and scale applications with confidence.", "tool_function": "Containers as a Service"}, {"name": "Testcontainers", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A library that integrates Docker with testing libs - for databases, Selenium web browsers, or anything else that can run in a Docker container", "description": "It is a Java library that supports JUnit tests, providing lightweight, throwaway instances of common databases, Selenium web browsers, or anything else that can run in a Docker container.", "tool_function": "Container Tools"}, {"name": "Vim", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Highly configurable text editor built to enable efficient text editing", "description": "Vim is an advanced text editor that seeks to provide the power of the de-facto Unix editor 'Vi', with a more complete feature set. Vim is a highly configurable text editor built to enable efficient text editing. It is an improved version of the vi editor distributed with most UNIX systems. Vim is distributed free as charityware. ", "tool_function": "Text Editor"}, {"name": "Grafana", "category": "DevOps", "subcategory": "Monitoring", "title": "Open source Graphite & InfluxDB Dashboard and Graph Editor", "description": "Grafana is a general purpose dashboard and graph composer. It's focused on providing rich ways to visualize time series metrics, mainly though graphs but supports other ways to visualize data through a pluggable panel architecture. It currently has rich support for for Graphite, InfluxDB and OpenTSDB. But supports other data sources via plugins.", "tool_function": "Monitoring Tools"}, {"name": "GitHub Enterprise", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The on-premises version of GitHub, which you can deploy and manage in your own, secure environment", "description": "GitHub Enterprise lets developers use the tools they love across the development process with support for popular IDEs, continuous integration tools, and hundreds of third party apps and services.", "tool_function": "Code Collaboration & Version Control"}, {"name": "Emacs", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "The extensible self-documenting text editor.", "description": "GNU Emacs is an extensible, customizable text editor—and more. At its core is an interpreter for Emacs Lisp, a dialect of the Lisp programming language with extensions to support text editing. ", "tool_function": "Text Editor"}, {"name": "ruxit", "category": "DevOps", "subcategory": "Monitoring", "title": "Full stack availability and performance monitoring powered by artificial intelligence", "description": "Ruxit is a all-in-one performance monitoring solution for cloud natives. In under five minutes customizable dashboard views show you your application's performance data. ", "tool_function": "Performance Monitoring"}, {"name": "Babel", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Use next generation JavaScript, today.", "description": "Babel will turn your ES6+ code into ES5 friendly code, so you can start using it right now without waiting for browser support.", "tool_function": "JavaScript Compilers"}, {"name": "AppDynamics", "category": "DevOps", "subcategory": "Monitoring", "title": "Application management for the cloud generation", "description": "AppDynamics develops application performance management (APM) solutions that deliver problem resolution for highly distributed applications through transaction flow monitoring and deep diagnostics.", "tool_function": "Performance Monitoring"}, {"name": "Split", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Split provides a unified solution for feature flags and experimentation ", "description": "Feature flags as a service for data-driven teams: Split automatically tracks changes to key metrics during every feature rollout. Split serves billions of impressions, helping organizations of all sizes to rapidly turn ideas into products.", "tool_function": "Feature Flags Management"}, {"name": "Mocha", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Simple, flexible, fun javascript test framework for node.js & the browser", "description": "Mocha is a feature-rich JavaScript test framework running on node.js and the browser, making asynchronous testing simple and fun. Mocha tests run serially, allowing for flexible and accurate reporting, while mapping uncaught exceptions to the correct test cases. ", "tool_function": "Javascript Testing Framework"}, {"name": "Amazon CloudWatch", "category": "DevOps", "subcategory": "Monitoring", "title": "Monitor AWS resources and custom metrics generated by your applications and services", "description": "It helps you gain system-wide visibility into resource utilization, application performance, and operational health. It retrieve your monitoring data, view graphs to help take automated action based on the state of your cloud environment.", "tool_function": "Cloud Monitoring"}, {"name": "Vault", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Secure, store, and tightly control access to tokens, passwords, certificates, API keys, and other secrets in modern computing", "description": "Vault is a tool for securely accessing secrets. A secret is anything that you want to tightly control access to, such as API keys, passwords, certificates, and more. Vault provides a unified interface to any secret, while providing tight access control and recording a detailed audit log.", "tool_function": "Secrets Management"}, {"name": "Confidant", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "An open-source secret management service from Lyft", "description": "Confidant is a open source secret management service that provides user-friendly storage and access to secrets in a secure way, from the developers at Lyft.", "tool_function": "Secrets Management"}, {"name": "Kong", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Open Source Microservice & API Management Layer", "description": "Kong is a scalable, open source API Layer (also known as an API Gateway, or API Middleware). Kong controls layer 4 and 7 traffic and is extended through Plugins, which provide extra functionality and services beyond the core platform.", "tool_function": "Microservices Tools"}, {"name": "StillAlive", "category": "DevOps", "subcategory": "Monitoring", "title": "A simple, easy to implement way to check that your website is up, and also that it's still working properly.", "description": "Using our stories feature, you can test many different features of your live, production website. It could be you need to find out if logins are working. Whatever it is, StillAlive can (or will) be able to test it.", "tool_function": "Website Monitoring"}, {"name": "Zipkin", "category": "DevOps", "subcategory": "Monitoring", "title": "A distributed tracing system", "description": "It helps gather timing data needed to troubleshoot latency problems in service architectures. Features include both the collection and lookup of this data.", "tool_function": "Monitoring Tools"}, {"name": "Nomad", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A cluster manager and scheduler", "description": "Nomad is a cluster manager, designed for both long lived services and short lived batch processing workloads. Developers use a declarative job specification to submit work, and Nomad ensures constraints are satisfied and resource utilization is optimized by efficient task packing. Nomad supports all major operating systems and virtualized, containerized, or standalone applications.\r\n", "tool_function": "Cluster Management"}, {"name": "Jest", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Painless JavaScript Unit Testing", "description": "Jest provides you with multiple layers on top of Jasmine.", "tool_function": "Javascript Testing Framework"}, {"name": "LaunchDarkly", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Feature Management Platform", "description": "Serving over 200 billion feature flags daily to help software teams build better software, faster. LaunchDarkly helps eliminate risk for developers and operations teams from the software development cycle.", "tool_function": "Feature Flags Management"}, {"name": "fastlane", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Connect all iOS deployment tools into one streamlined workflow", "description": "fastlane lets you define and run your deployment pipelines for different environments. It helps you unify your app’s release process and automate the whole process. fastlane connects all fastlane tools and third party tools, like CocoaPods.", "tool_function": "Mobile Continuous Integration"}, {"name": "Nagios", "category": "DevOps", "subcategory": "Monitoring", "title": "Complete monitoring and alerting for servers, switches, applications, and services", "description": "Nagios is a host/service/network monitoring program written in C and\r\nreleased under the GNU General Public License.", "tool_function": "Monitoring Tools"}, {"name": "warp", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Secure and simple terminal sharing", "description": "warp lets you securely share your terminal with one simple command: warp open. When connected to your warp, clients can see your terminal exactly as if they were sitting next to you. You can also grant them write access, the equivalent of handing them your keyboard.", "tool_function": "localhost Tools"}, {"name": "Istio", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Open platform to connect, manage, and secure microservices, by Google, IBM, and Lyft", "description": "Istio is an open platform for providing a uniform way to integrate microservices, manage traffic flow across microservices, enforce policies and aggregate telemetry data. Istio's control plane provides an abstraction layer over the underlying cluster management platform, such as Kubernetes, Mesos, etc.", "tool_function": "Microservices Tools"}, {"name": "Logstash", "category": "DevOps", "subcategory": "Monitoring", "title": "Collect, Parse, & Enrich Data", "description": "Logstash is a tool for managing events and logs. You can use it to collect logs, parse them, and store them for later use (like, for searching). If you store them in Elasticsearch, you can view and analyze them with Kibana.", "tool_function": "Log Management"}, {"name": "PhpStorm", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Professional IDE for PHP and Web Developers", "description": "PhpStorm is a PHP IDE which keeps up with latest PHP & web languages trends, integrates a variety of modern tools, and brings even more extensibility with support for major PHP frameworks.", "tool_function": "Integrated Development Environment"}, {"name": "Crashlytics", "category": "DevOps", "subcategory": "Monitoring", "title": "The world's most powerful, yet lightest weight crash reporting solution. Free for everybody.", "description": "Instead of just showing you the stack trace, Crashlytics performs deep analysis of each and every thread. We de-prioritize lines that don't matter while highlighting the interesting ones. This makes reading stack traces easier, faster, and far more useful! Crashlytics' intelligent grouping can take 50,000 crashes, distill them down to 20 unique issues, and then tell you which 3 are the most important to fix.", "tool_function": "Mobile Error Monitoring"}, {"name": "VividCortex", "category": "DevOps", "subcategory": "Monitoring", "title": "The best way to monitor your production databases.", "description": "VividCortex is a SaaS product for database performance monitoring. It accelerates IT delivery and improves database performance, reducing cost and increasing uptime. \r\n\r\n(https://www.vividcortex.com/resources/vividcortex-product-demo-video)", "tool_function": "Performance Monitoring"}, {"name": "TestFlight", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "iOS beta testing on the fly.", "description": "With TestFlight, developers simply upload a build, and the testers can install it directly from their device, over the air.", "tool_function": "Beta Testing / Mobile App Distribution"}, {"name": "Appium", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Automation for iOS and Android Apps", "description": "Appium is an open source test automation framework for use with native, hybrid, and mobile web apps. It drives iOS and Android apps using the WebDriver protocol. Appium is sponsored by Sauce Labs and a thriving community of open source developers.", "tool_function": "Mobile Testing Frameworks"}, {"name": "StatsD", "category": "DevOps", "subcategory": "Monitoring", "title": "Simple daemon for easy stats aggregation", "description": "It is a network daemon that runs on the Node.js platform and listens for statistics, like counters and timers, sent over UDP or TCP and sends aggregates to one or more pluggable backend services (e.g., Graphite).", "tool_function": "Monitoring Tools"}, {"name": "TeamCity", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "TeamCity is an ultimate Continuous Integration tool for professionals", "description": "TeamCity is a user-friendly continuous integration (CI) server for professional developers, build engineers, and DevOps. It is trivial to setup and absolutely free for small teams and open source projects.", "tool_function": "Continuous Integration"}, {"name": "Karate DSL", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Open Source Web-Services Test Automation Framework", "description": "Combines API test-automation, mocks and performance-testing into a single, unified framework. The BDD syntax popularized by Cucumber is language-neutral, and easy for even non-programmers. Besides powerful JSON & XML assertions, you can run tests in parallel for speed - which is critical for HTTP API testing.", "tool_function": "Testing Frameworks"}, {"name": "Log4j", "category": "DevOps", "subcategory": "Monitoring", "title": "A Java-based logging utility", "description": "It is an open source logging framework. With this tool – logging behavior can be controlled by editing a configuration file only without touching the application binary and can be used to store the Selenium Automation flow logs.", "tool_function": "Logging Tools"}, {"name": "Harbor", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Manage and serve container images in a secure environment (created at VMware)", "description": "Harbor is an open source cloud native registry that stores, signs, and scans container images for vulnerabilities.\r\n\r\nHarbor solves common challenges by delivering trust, compliance, performance, and interoperability. It fills a gap for organ", "tool_function": "Docker Registry"}, {"name": "RuboCop", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "A Ruby static code analyzer, based on the community Ruby style guide", "description": "RuboCop is a Ruby static code analyzer. Out of the box it will enforce many of the guidelines outlined in the community Ruby Style Guide.", "tool_function": "Code Review"}, {"name": "Spring Cloud", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Spring helps development teams everywhere build simple, portable,fast and flexible JVM-based systems and applications.", "description": "It provides tools for developers to quickly build some of the common patterns in distributed systems.", "tool_function": "Container Tools"}, {"name": "Cypress", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "When testing is easy, developers build better things faster and with confidence.", "description": "Cypress is a front end automated testing application created for the modern web. Cypress is built on a new architecture and runs in the same run-loop as the application being tested. As a result Cypress provides better, faster, and more reliable testing for anything that runs in a browser. Cypress works on any front-end framework or website. ", "tool_function": "Javascript Testing Framework"}, {"name": "Argo", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Container-native workflows for Kubernetes", "description": "Argo is an open source container-native workflow engine for getting work done on Kubernetes. Argo is implemented as a Kubernetes CRD (Custom Resource Definition).", "tool_function": "Container Tools"}, {"name": "Amazon EKS", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Highly available and scalable Kubernetes service", "description": "Amazon Elastic Container Service for Kubernetes (Amazon EKS) is a managed service that makes it easy for you to run Kubernetes on AWS without needing to install and operate your own Kubernetes clusters.", "tool_function": "Containers as a Service"}, {"name": "Hystrix", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Latency and fault tolerance library", "description": "Hystrix is a latency and fault tolerance library designed to isolate points of access to remote systems, services and 3rd party libraries, stop cascading failure and enable resilience in complex distributed systems where failure is inevitable.", "tool_function": "Fault Tolerance Tools"}, {"name": "Notepad++", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Free source code editor and Notepad replacement", "description": "Notepad++ is a free (as in \"free speech\" and also as in \"free beer\") source code editor and Notepad replacement that supports several languages. Running in the MS Windows environment, its use is governed by GPL License.", "tool_function": "Text Editor"}, {"name": "SonarQube", "category": "DevOps", "subcategory": "Build, Test, Deploy", "title": "Continuous Code Quality", "description": "SonarQube provides an overview of the overall health of your source code and even more importantly, it highlights issues found on new code. With a Quality Gate set on your project, you will simply fix the Leak and start mechanically improving.", "tool_function": "Code Review"}, {"name": "Google Fonts", "category": "Business Tools", "subcategory": "Design", "title": "Making the web more beautiful, fast, and open through great typography", "description": "A library of 915 free licensed fonts, an interactive web directory for browsing the library, and APIs for conveniently using the fonts via CSS and Android.", "tool_function": "Fonts"}, {"name": "WordPress", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A semantic personal publishing platform with a focus on aesthetics, web standards, and usability.", "description": "The core software is built by hundreds of community volunteers, and when you’re ready for more there are thousands of plugins and themes available to transform your site into almost anything you can imagine. Over 60 million people have chosen WordPress to power the place on the web they call “home” — we’d love you to join the family.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "Font Awesome", "category": "Business Tools", "subcategory": "Design", "title": "The internet's most popular icon toolkit", "description": "You can get vector icons and social logos on your website with it. It is a font that's made up of symbols, icons, or pictograms that you can use in a webpage, just like a font.", "tool_function": "Fonts"}, {"name": "G Suite", "category": "Business Tools", "subcategory": "Collaboration", "title": "Collaboration and productivity apps for Business", "description": "An integrated suite of secure, cloud-native collaboration and productivity apps. It includes Gmail, Docs, Drive, Calendar, Meet and more.", "tool_function": "Productivity Suite"}, {"name": "Gmail", "category": "Business Tools", "subcategory": "Back Office", "title": "A free web-based e-mail service", "description": "An easy to use email app that saves you time and keeps your messages safe. Get your messages instantly via push notifications, read and respond online & offline, and find any message quickly.", "tool_function": "Email Services"}, {"name": "Drupal", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Free, Open, Modular CMS written in PHP", "description": "Drupal is an open source content management platform powering millions of websites and applications. It’s built, used, and supported by an active and diverse community of people around the world.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "Marketo", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Helping marketers master the art and science of digital marketing", "description": "Marketing automation, social campaigns, inbound marketing, sales apps, ROI reporting - all in one place.", "tool_function": "Marketing Automation"}, {"name": "Slack", "category": "Business Tools", "subcategory": "Collaboration", "title": "Bring all your communication together in one place", "description": "Imagine all your team communication in one place, instantly searchable, available wherever you go. That’s Slack. All your messages. All your files. And everything from Twitter, Dropbox, Google Docs, Asana, Trello, GitHub and dozens of other services. All together.", "tool_function": "Group Chat & Notifications"}, {"name": "Jira", "category": "Business Tools", "subcategory": "Collaboration", "title": "The #1 software development tool used by agile teams to plan, track, and release great software.", "description": "Jira's secret sauce is the way it simplifies the complexities of software development into manageable units of work. \r\nJira comes out-of-the-box with everything agile teams need to ship value to customers faster.", "tool_function": "Issue Tracking"}, {"name": "Typekit", "category": "Business Tools", "subcategory": "Design", "title": "An online service offering high-quality fonts", "description": "It is an online service which offers a subscription library of high-quality fonts. The fonts may be used directly on websites or synced via Adobe Creative Cloud to applications on the subscriber's computers.", "tool_function": "Fonts"}, {"name": "AdRoll", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "The e-commerce marketing platform for growing direct-to-consumer brands", "description": "It is an e-commerce marketing platform that gives growing D2C brands the power to connect with customers wherever they are.", "tool_function": "Ad Retargeting"}, {"name": "Confluence", "category": "Business Tools", "subcategory": "Collaboration", "title": "One place to share, find, and collaborate on information", "description": "Capture the knowledge that's too often lost in email inboxes and shared network drives in Confluence instead – where it's easy to find, use, and update.", "tool_function": "Project Management"}, {"name": "AddThis", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A content sharing platform", "description": "It provide tools that make it easier to share content across the social web, and provides publishers with increased traffic and in-depth analytics.", "tool_function": "Social Media Tools"}, {"name": "Acquia", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Drupal Hosting Platform", "description": "The leader in enterprise Drupal solutions providing a powerful cloud-native platform to build, operate, and optimize your digital experience. It provide enterprise products, services, and technical support for the open-source web content management platform Drupal.", "tool_function": "Hosted Blogging Platforms"}, {"name": "HubSpot", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "All the software you need to do inbound marketing.", "description": "Attract, convert, close and delight customers with HubSpot’s complete set of marketing tools. HubSpot all-in-one marketing software helps more than 12,000 companies in 56 countries attract leads and convert them into customers. ", "tool_function": "Marketing Automation"}, {"name": "Adobe Experience Manager", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A comprehensive content management solution for building websites, mobile apps and forms", "description": "It is a Web Content Management System that allows companies to manage their web content (Web pages, digital assets, forms, etc) and also create digital experiences with this content on any platform web, mobile or IoT.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "Pardot", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Software as a Service (SaaS) marketing automation platform ", "description": "It is a software as a service (SaaS) marketing automation platform offering email automation, targeted email campaigns and lead management for B2B sales and marketing organizations. It provides a full solution that helps marketers create meaningful connections, generate more pipeline, and empower sales to close more deals.\r\n\r\n", "tool_function": "Marketing Automation"}, {"name": "InVision", "category": "Business Tools", "subcategory": "Design", "title": "Prototyping & Collaboration For Design Teams", "description": "InVision lets you create stunningly realistic interactive wireframes and prototypes without compromising your creative vision.", "tool_function": "Interactive Mockups"}, {"name": "Intercom", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A fundamentally new way to communicate with your customers", "description": "Intercom is a customer communication platform with a suite of integrated products for every team—including sales, marketing, product, and support. Have targeted communication with customers on your website, inside  apps, and by email.", "tool_function": "Engagement/Lifecycle Marketing"}, {"name": "Salesforce Salescloud", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "The world’s #1 CRM sales app", "description": "The Sales Cloud puts everything you need at your fingertips—available anywhere. From Social accounts and contacts to Mobile, Chatter, and Analytics, collaboration across your global organization and getting deals done faster is not only possible, it's easy.", "tool_function": "CRM"}, {"name": "Skype", "category": "Business Tools", "subcategory": "Collaboration", "title": "Voice calls, instant messaging, file transfer, and video conferencing", "description": "Skype’s text, voice and video make it simple to share experiences with the people that matter to you, wherever they are.", "tool_function": "Web and Video Conferencing"}, {"name": "Mailchimp", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Easy email newsletters", "description": "MailChimp helps you design email newsletters, share them on social networks, integrate with services you already use, and track your results. It's like your own personal publishing platform.", "tool_function": "Email Marketing"}, {"name": "ExpressionEngine", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Open-Source and feature-rich content management system", "description": "It is a flexible, feature-rich, free open-source content management platform that empowers hundreds of thousands of individuals and organizations around the world to easily manage their web site.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "Microsoft 365", "category": "Business Tools", "subcategory": "Collaboration", "title": "Enterprise-class set of productivity tools and cloud-based email", "description": "Office is becoming Microsoft 365. Boost productivity with Microsoft Teams, Word, Excel, PowerPoint, and more—all in one place.", "tool_function": "Productivity Suite"}, {"name": "Zopim", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Real-time customer satisfaction made simple", "description": "Zopim is focused on serving the needs of web users that hasn’t been met by other chat solutions: the need for usability, convenience and simplicity of design", "tool_function": "Customer Support Chat"}, {"name": "Quantcast", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A technology company specializing in real-time advertising and audience measurement", "description": "It is a digital marketing company that provides free audience demographics measurement and delivers real-time advertising.", "tool_function": "Advertising"}, {"name": "Discourse", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "The 100% open source, next-generation discussion platform built for the next decade of the Internet.", "description": "Discourse is a simple, flat forum, where replies flow down the page in a line. Replies are attached to the bottom and top of each post, so you can optionally expand the context of the conversation – without breaking your flow. ", "tool_function": "Forums"}, {"name": "Microsoft SharePoint", "category": "Business Tools", "subcategory": "Collaboration", "title": "Content collaboration for the modern workplace", "description": "It empowers teamwork with dynamic and productive team sites for every project team, department, and division. Share and manage content, knowledge, and applications to empower teamwork, quickly find information, and seamlessly collaborate across the organization. ", "tool_function": "Document Collaboration"}, {"name": "Joomla!", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A content management system helping both novice users and expert developers to create powerful websites and applications", "description": "Joomla is a simple and powerful web server application and it requires a server with PHP and either MySQL, PostgreSQL, or SQL Server to run it.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "Zendesk", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "The leading cloud-based customer service software solution. ", "description": "Zendesk provides an integrated on-demand helpdesk - customer support portal solution based on the latest Web 2.0 technologies and design philosophies.", "tool_function": "Help Desk"}, {"name": "Concrete CMS", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A simple and powerful content management system", "description": "It is an open-source content management system for publishing content on the World Wide Web and intranets. It is designed for ease of use, for users with a minimum of technical skills. It enables users to edit site content directly from the page.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "DokuWiki", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Open Source wiki software that doesn't require a database", "description": "It is a simple to use and highly versatile Open Source wiki software that doesn't require a database. It has clean and readable syntax. The ease of maintenance, backup and integration makes it an administrator's favorite. Built in access controls and authentication connectors make it especially useful in the enterprise context and the large number of plugins contributed by its vibrant community allow for a broad range of use cases beyond a traditional wiki.", "tool_function": "Self-Hosted Blogging / CMS"}, {"name": "OneLogin", "category": "Business Tools", "subcategory": "Collaboration", "title": "On-demand SSO, directory integration, user provisioning and more", "description": "OneLogin provides a cloud-based identity and access management (IAM) solution that offers simple single sign-on (SSO), making it easier for companies to secure and manage access to web applications both in the cloud and behind the firewall. ", "tool_function": "Password Management"}, {"name": "Aha!", "category": "Business Tools", "subcategory": "Collaboration", "title": "Roadmapping software for PMs who want their mojo back", "description": "Set product strategy, visualize and share roadmaps, and articulate features so your product development teams can build what matters. ", "tool_function": "Project Management"}, {"name": "Concur", "category": "Business Tools", "subcategory": "Back Office", "title": "Your go-to source for all things Travel and Expense.", "description": "Employees can book domestic and international flights, reserve rental cars and make hotel and rail reservations - all from their smartphones or desktop browser. Thanks to the integration of travel with expense reporting, all itineraries and credit card charges are automatically imported.", "tool_function": "Expense Management"}, {"name": "1Password", "category": "Business Tools", "subcategory": "Collaboration", "title": "Streamline how you manage passwords and development secrets throughout your workflows.", "description": "Lock credentials and secrets in vaults that sync across systems and seamlessly access within your dev, CI/CD, and production environments. Plus, generate and use SSH keys directly from 1Password, automate infrastructure secrets, and more. ", "tool_function": "Password Management"}, {"name": "Trello", "category": "Business Tools", "subcategory": "Collaboration", "title": "Your entire project, in a single glance", "description": "Trello is a collaboration tool that organizes your projects into boards. In one glance, Trello tells you what's being worked on, who's working on what, and where something is in a process.", "tool_function": "Project Management"}, {"name": "WP Rocket", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Premium Caching Plugin for WordPress", "description": "Speed up your WordPress website, more trafic, conversions and money with this caching plugin. Caching creates an ultra-fast load time, essential for improving Search Engine Optimization and increasing conversions.", "tool_function": "CMS Tools"}, {"name": "Elementor", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Drag & Drop page builder for WordPress", "description": "Create beautiful websites using a simple, intuitive drag and drop Interface.It offers pixel perfect design, yet produces 100% clean code. Take your design vision and turn it into a stunning custom-made website. It's fast and easy.", "tool_function": "CMS Tools"}, {"name": "LiveChat", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Powerful live chat software", "description": "LiveChat provides a live chat application with help desk and web analytics functionalities, allowing online businesses to communicate with visitors in real time.", "tool_function": "Customer Support Chat"}, {"name": "Contact Lab", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Engagement intelligence with a human touch", "description": "Itis a digital direct marketing company providing solutions for newsletter monitoring and other web-based communications and contact strategies.", "tool_function": "Marketing Automation"}, {"name": "Sparkcentral", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Enterprise social media helpdesk platform", "description": "If you’re handling an influx of questions over social media, your team must work swiftly and accurately. Sparkcentral enables your team to provide the best social media customer experience.", "tool_function": "Social Media Tools"}, {"name": "osTicket", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Open source support ticketing system", "description": "It seamlessly routes inquiries created via email, web-forms and phone calls into a simple, easy-to-use, multi-user, web-based customer support platform.", "tool_function": "Help Desk"}, {"name": "PlantUML", "category": "Business Tools", "subcategory": "Collaboration", "title": "Generate diagrams from textual description", "description": "It is used to draw UML diagrams, using a simple and human readable text description.\r\n\r\nBe careful, because it does not prevent you from drawing inconsistent diagrams. So it's more a drawing tool than a modeling tool. It is a component that allows to quickly write Sequence diagram, Usecase diagram, Class diagram, Object diagram, Activity diagram, Component diagram, Deployment diagram, State diagram, and Timing diagram.", "tool_function": "Diagramming"}, {"name": "HipChat", "category": "Business Tools", "subcategory": "Collaboration", "title": "Supercharge team collaboration with group chat and IM", "description": "HipChat is a hosted private chat service for your company or team. Invite colleagues to share ideas and files in persistent group chat rooms. Get your team off AIM, Google Talk, and Skype — HipChat was built for business.", "tool_function": "Group Chat & Notifications"}, {"name": "Zoho Mail", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Secure email hosting for your business", "description": "It is a secure and reliable business email solution tailor-made for your organization's communication needs. With enhanced collaboration features, it's not just an inbox—it's more.", "tool_function": "Email Marketing"}, {"name": "Qualaroo", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Design and target surveys in minutes", "description": "Once you implement the Qualaroo code (it generally only takes a couple minutes), you can easily target a survey question or two as users are making decisions on your website. Your customers will see it slide up from the bottom right-hand corner of your site.", "tool_function": "Survey Widget"}, {"name": "Pivotal Tracker", "category": "Business Tools", "subcategory": "Collaboration", "title": "Provides a proven agile project management tool for delivering better products", "description": "It is a collaborative, lightweight agile project management tool, brought to you by the experts in agile software development.", "tool_function": "Agile Project Management"}, {"name": "Help Scout", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A help desk for teams that insist on a delightful customer experience", "description": "With best in-class-reporting, an integrated knowledge base, 50+ integrations and a robust API, Help Scout lets your team focus on what really matters: your customers.", "tool_function": "Help Desk"}, {"name": "Balsamiq", "category": "Business Tools", "subcategory": "Collaboration", "title": "Rapid wireframing tool that helps you work faster & smarter", "description": "Balsamiq Mockups is a web tool that allows users to mock up different designs and ideas quickly and easily. Balsamic Mockups is similar to drawing mockups, but it is digital", "tool_function": "Wireframing"}, {"name": "SAP", "category": "Business Tools", "subcategory": "Back Office", "title": "An ERP software used for effective business operations", "description": "It is an ERP (Enterprise Resource Planning) software used for effective business operations. It is used for below operations: Supply Chain Management. Product lifecycle management.", "tool_function": "Enterprise Resource Planning (ERP)"}, {"name": "Unbounce", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "The fastest and most powerful do-it-yourself landing page platform", "description": "Unbounce is a self-serve hosted service that provides marketers doing paid search, banner ads, email or social media marketing, the easiest way to create, publish & test promotion specific landing pages without the need for IT or developers.", "tool_function": "Landing Pages"}, {"name": "Frontify", "category": "Business Tools", "subcategory": "Design", "title": "Brand management platform to connect creators and collaborators with everything they need to make your brand thrive", "description": "Frontify is a cloud-based brand management platform for creators and collaborators of brands, connecting everything (and everyone) important to the growth of your brand.", "tool_function": "Graphic Design"}, {"name": "FreshDesk", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Refreshing the way thousands of help desk agents support their customers everyday, world wide", "description": "Freshdesk is an on demand customer support software that works across multiple support channels.", "tool_function": "Help Desk"}, {"name": "drawio", "category": "Business Tools", "subcategory": "Collaboration", "title": "An Open source diagramming tool", "description": "It is a free online diagram software for making flowcharts, process diagrams, org charts, UML, ER and network diagrams. It is an open platform where you can create and share diagrams. It’s integrated with the tools you already use.", "tool_function": "Diagramming"}, {"name": "Liferay", "category": "Business Tools", "subcategory": "Collaboration", "title": "Open source portal, content, collaboration software", "description": "It makes software that helps companies create digital experiences on web, mobile and connected devices.", "tool_function": "Enterprise Collaboration"}, {"name": "Medium", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "The perfect place to read and write.", "description": "Medium is a different kind of place on the internet. A place where the measure of success isn’t views, but viewpoints. Where the quality of the idea matters, not the author’s qualifications. A place where conversation pushes ideas forward.", "tool_function": "Hosted Blogging Platforms"}, {"name": "UXPin", "category": "Business Tools", "subcategory": "Collaboration", "title": "The Full-Stack UX Design Platform", "description": "It is a code-based design tool that merges design and engineering into one unified process. Thanks to conditional interactions, variables, state-based animations, and powerful expressions, you can build prototypes that feel like the real thing. In other words, anything that's on the web can be accurately prototyped in UXPin.", "tool_function": "Wireframing"}, {"name": "Microsoft Teams", "category": "Business Tools", "subcategory": "Collaboration", "title": "Chat-based workspace in Office 365", "description": "See content and chat history anytime, including team chats with Skype that are visible to the whole team. Private group chats are available for smaller group conversations.", "tool_function": "Group Chat & Notifications"}, {"name": "DocuSign", "category": "Business Tools", "subcategory": "Collaboration", "title": "The fastest, most secure way to sign, send, and store documents in the cloud. ", "description": "DocuSign automates manual, paper-based processes allowing you to manage all aspects of documented business transactions, including identity management, authentication, digital signature, forms/data collection, collaboration, workflow automation and storage. ", "tool_function": "Document Signature"}, {"name": "HelloSign", "category": "Business Tools", "subcategory": "Collaboration", "title": "Embed signing functionality into your own site with just a few lines of code.", "description": "HelloSign provides fast, secure, and legally binding eSignatures for Business. Our API gives you the ability to embed signing right into your own site with just a few lines of code. Set-up only takes minutes to complete.", "tool_function": "Document Signature"}, {"name": "Namely", "category": "Business Tools", "subcategory": "Back Office", "title": "The First HR, Payroll, and Benefits Platform Your Employees Will Love", "description": "It is the only HR, payroll, benefits, and talent management platform your employees will love. It’s more than HR software: It’s the compliance and benefits consulting you need.", "tool_function": "Payroll & Benefits"}, {"name": "Tipe", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Generate an API-first CMS from a schema file with offline prototyping, an inline editor, and with a REST or GraphQL API", "description": "All your Apps have text and your developers don't want to manage it. Create and manage your text or assets with powerful editing tools and access it from anywhere with a GraphQL or REST API.", "tool_function": "Cloud Content Management System"}, {"name": "Workday", "category": "Business Tools", "subcategory": "Back Office", "title": "HR and finance apps built for the future", "description": "Workday is a leading provider of enterprise cloud applications for human resources and finance. Founded in 2005, Workday delivers human capital management, financial management, and analytics applications designed for the world’s largest organizations. Hundreds of companies, ranging from medium-sized businesses to Fortune 50 enterprises, have selected Workday.", "tool_function": "Enterprise Resource Planning (ERP)"}, {"name": "Eloqua", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A service (SaaS) platform for marketing automation offered by Oracle", "description": "Successful demand generation, email marketing, and lead management engagement hinge on a modern platform and strategy aligned to buyer needs across all phases and channels of the buying process", "tool_function": "Marketing Automation"}, {"name": "ServiceNow.com", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A service management software", "description": "It makes work, work better for people. Transform old, manual ways of working into modern digital workflows, so employees and customers get what they need, when they need it—fast, simple, easy.\r\n", "tool_function": "Help Desk"}, {"name": "Google AdSense", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "A program that allows bloggers and website owners to make money by displaying Google ads", "description": "It is a program run by Google through which website publishers in the Google Network of content sites serve text, images, video, or interactive media advertisements that are targeted to the site content and audience. ", "tool_function": "Advertising"}, {"name": "Jell", "category": "Business Tools", "subcategory": "Collaboration", "title": "Daily Standups and Team Check-Ins", "description": "Keep your team up to date — without another meeting.", "tool_function": "Team Task Management"}, {"name": "Contentful", "category": "Business Tools", "subcategory": "Support, Sales, and Marketing", "title": "Contentful is a cloud-based API-first content platform ", "description": "With Contentful, you can bring your content anywhere using our APIs, completely customize your content structure all while using your preferred programming languages and frameworks.", "tool_function": "Cloud Content Management System"}, {"name": "Asana", "category": "Business Tools", "subcategory": "Collaboration", "title": "Enabling the teams to work together effortlessly", "description": "Asana is the easiest way for teams to track their work. From tasks and projects to conversations and dashboards, Asana enables teams to move work from start to finish--and get results. Available at asana.com and on iOS & Android.\r\n", "tool_function": "Project Management"}]